zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
<?xml version='1.0' encoding='utf-8'?>
<device schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance">
    <name>FM33L0XX</name> 
    <version>1.0</version>
    <!--initial version-->
    <description>ARM 32-bit Cortex SC000 Microcontroller based device</description>
    <cpu>
        <!-- details about the cpu embedded in the device -->
        <name>SC000</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>3</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <!-- byte addressable memory -->
    <width>32</width>
    <!-- bus width is 32 bits -->
    <resetValue>0x00000000</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <!--DBG-->
        <peripheral>
            <name>DBG</name>
            <description>Debug config unit</description>
            <groupName>DBG</groupName>
            <baseAddress>0x40000000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--SYSCON: System Config Register-->
                <register>
                    <name>SYSCON</name>
                    <description>System Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSCFG-->
                        <field>
                            <name>FLSCFG</name>
                            <description>Flash Config</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>128KB</name>
                                    <description>Flash size is 128K</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>64KB</name>
                                    <description>Flash size is 64K</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RDPROTFAIL-->
                        <field>
                            <name>RDPROTFAIL</name>
                            <description>NVR5 Validation fail</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PASS</name>
                                    <description>NVR0 Validation pass</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FAIL</name>
                                    <description>NVR0 Validation fail</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VERIFAIL-->
                        <field>
                            <name>VERIFAIL</name>
                            <description>VERIFY FAIL</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PASS</name>
                                    <description>NVR1 verify pass</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FAIL</name>
                                    <description>NVR1 verify pass</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CR: Debug Config Register-->
                <register>
                    <name>CR</name>
                    <description>debug congfig, only use at bebug mode </description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00002D03</resetValue>
                    <fields>
                        <!--IWDT_STOP:IWDT STOP AT DEBUG-->
                        <field>
                            <name>IWDT_STOP</name>
                            <description>SET IWDT STOP AT DEBUG</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>iwdt is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>iwdt is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WWDT_STOP: WWDT STOP AT DEBUG-->
                        <field>
                            <name>WWDT_STOP</name>
                            <description>SET WWDT STOP AT DEBUG</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>wwdt is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>wwdt is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BT_STOP: BT STOP AT DEBUG-->
                        <field>
                            <name>BT_STOP</name>
                            <description>set BT stop at debug</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>BT is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>BT is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--GT0_STOP: GT0 STOP AT DEBUG-->
                        <field>
                            <name>GT0_STOP</name>
                            <description>set GT0 stop at debug</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>GT0 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>GT0 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--GT1_STOP: GT1 STOP AT DEBUG-->
                        <field>
                            <name>GT1_STOP</name>
                            <description>set GT2 stop at debug</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>GT1 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>GT1 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>            
                        <!--AT_STOP: AT STOP AT DEBUG-->
                        <field>
                            <name>AT_STOP</name>
                            <description>set AT stop at debug</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>AT is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>AT is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--HDFR: HARD FAULT FLAG Register -->
                <register>
                    <name>HDFR</name>
                    <description>Hard Fault Flag </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!-- hdf_request_flag: any hard fault is request, write 1 to clear-->
                        <field>
                            <name>HDF_REQUEST_FLAG</name>
                            <description>any hard fault is request</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOREQ</name>
                                    <description>no hard fault is rquested</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REQ</name>
                                    <description>some hard fault is requested</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--special_op_flag: special operation is implimented, write 1 to clear-->
                        <field>
                            <name>SPECIAL_OP_FLAG</name>
                            <description> special operation is implimented </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOREQ</name>
                                    <description>no special operation fault is rquested</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REQ</name>
                                    <description>Special operation fault is rquested</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--tbit_flag: Thumb-State flag, write 1 to clear-->
                        <field>
                            <name>TBIT_FLAG</name>
                            <description>Thumb-State flag, write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Thumb-State</name>
                                    <description>at Thumb-State</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ARM_State</name>
                                    <description>At ARM state</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--bkpt_flag: BKPT operation is implimented, Write 1 to clear-->
                        <field>
                            <name>BKPT_FLAG</name>
                            <description>BKPT operation is implimented, Write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOBKPT</name>
                                    <description>no BKPT operation is implimented</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BKPTONCE</name>
                                    <description>at least one BKPT operation is implimented</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--svcundef_flag: SVC undefined flag, write 1 to clear-->
                        <field>
                            <name>SVCUNDEF_FLAG</name>
                            <description> special operation is implimented </description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--dabort_resp_flag: ilegal access to some address, write 1 to clear-->
                        <field>
                            <name>DABORT_RESP_FLAG</name>
                            <description>ilegal access to some address, write 1 to clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>legal_access</name>
                                    <description>all access is legal address</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ilegal_access</name>
                                    <description>some access is ilegal address</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--dabort_addr_flag: access adress is not alignment,write 1 to clear-->
                        <field>
                            <name>DABORT_ADDR_FLAG</name>
                            <description>access adress is not alignment,write 1 to clear</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>legal_access</name>
                                    <description>no operation is address unalignment</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ilegal_access</name>
                                    <description>some operation is address unalignment</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
