zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
        <!--PMU-->
        <peripheral>
            <name>PMU</name>
            <description>POWER MANAGEMENT UNIT</description>
            <groupName>PMU</groupName>
            <baseAddress>0x40000100</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--LPMCFG: Low Power Management Config Register-->
                <register>
                    <name>CR</name>
                    <description>Low Power Management Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060000</resetValue>
                    <fields>
                        <!--PMOD-->
                        <field>
                            <name>PMOD</name>
                            <description>power down mode </description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Active mode</name>
                                    <description>Active mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPRUN mode</name>
                                    <description>LPRUN mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name> Sleep mode</name>
                                    <description> Sleep mode</description>
                                    <value>2</value>
                                </enumeratedValue>                   
                            </enumeratedValues>
                        </field>                      
                        <!--CVS-->
                        <field>
                            <name>CVS</name>
                            <description>Core Voltage Scaling</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOScaling</name>
                                    <description>NOT Scaling at Sleep/DeepSleep/Stop mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Scaling</name>
                                    <description>Scaling to 1.2V at Sleep/DeepSleep/Stop mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLPDP-->
                        <field>
                            <name>SLPDP</name>
                            <description>DeepSleep config</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Sleep</name>
                                    <description>Sleep mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DeepSleep</name>
                                    <description>DeepSleep mode,close vref</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WKFSEL-->
                        <field>
                            <name>WKFSEL</name>
                            <description>Sleep Wakeup Frequency</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCHF-8M</name>
                                    <description>RCHF-8M</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF-16M</name>
                                    <description>RCHF-16M</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF-24M</name>
                                    <description>RCHF-24M</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RCHF-24M</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LDO15EN_B-->
                        <field>
                            <name>LDO15EN_B</name>
                            <description>LDO15 ENABLE BIT REVERSE</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ldo15 enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>shutdown</name>
                                    <description>ldo15 shutdown</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LDO15EN-->
                        <field>
                            <name>LDO15EN</name>
                            <description>LDO15 enable status</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LDO15 SHUT DOWN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LDO15 ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LDO_LPM-->
                        <field>
                            <name>LDO_LPM</name>
                            <description>LDO Low Power Config</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOMAL MODE</name>
                                    <description>NOMAL MODE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOMAL MODE</name>
                                    <description>NOMAL MODE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW POWER MODE</name>
                                    <description>LOW POWER MODE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOMAL MODE</name>
                                    <description>NOMAL MODE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
