zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--WKTR: Wakeup Delay Control Register-->
                <register>
                    <name>WKTR</name>
                    <description>Wakeup Delay Control Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <!--T1A:time of RHR-->
                        <field>
                            <name>TRHR</name>
                            <description>TIME OF RHR AT DeepSleep/Stop</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0us</name>
                                    <description>time of RHR is 0us</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4us</name>
                                    <description>time of RHR is 4us</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8us</name>
                                    <description>time of RHR is 8us</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16us</name>
                                    <description>time of RHR is 16us</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                     
                    </fields>
                </register>
                <!--WKFR:  Wakeup FLAG Register -->
                <register>
                    <name>WKFR</name>
                    <description>IO Wakeup FLAG Register </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WKPxF: wakeup flag of pinX-->
                        <field>
                            <name>WKPxF</name>
                            <description>wakeup flag of pinX</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DBGWKF: debug wakeup flag-->
                        <field>
                            <name>DBGWKF</name>
                            <description>debug wakeup flag,write 1 to clear</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NODBWK</name>
                                    <description>no debug wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DBWK</name>
                                    <description>debug wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BSTWKF: btim wakeup flag-->
                        <field>
                            <name>BSTWKF</name>
                            <description>btim wakeup flag</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOBTWK</name>
                                    <description>no btim wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BTWK</name>
                                    <description>btim wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPTWKF: lptim wakeup flag-->
                        <field>
                            <name>LPTWKF</name>
                            <description>lptim wakeup flag</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOLPTWK</name>
                                    <description>no lptim wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPTWK</name>
                                    <description>lptim wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OPA1WKF: opa1 wakeup flag-->
                        <field>
                            <name>OPA1WKF</name>
                            <description>opa1 wakeup flag</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOOPA1WK</name>
                                    <description>no opa1 wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OPA1WK</name>
                                    <description>opa1 wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OPA2WKF: opa2 wakeup flag-->
                        <field>
                            <name>OPA2WKF</name>
                            <description>opa2 wakeup flag</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOOPA2WK</name>
                                    <description>no opa2 wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OPA2WK</name>
                                    <description>opa2 wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--UART0WKF: uart0 wakeup flag-->
                        <field>
                            <name>UART0WKF</name>
                            <description>uart0 wakeup flag</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOUART0WK</name>
                                    <description>no uart0 wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0WK</name>
                                    <description>uart0 wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--UART1WKF: uart1 wakeup flag-->
                        <field>
                            <name>UART1WKF</name>
                            <description>uart1 wakeup flag</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOUART1WK</name>
                                    <description>no uart1 wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1WK</name>
                                    <description>uart1 wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPUART0WKF: lpuart0 wakeup flag-->
                        <field>
                            <name>LPU0WKF</name>
                            <description>lpuart0 wakeup flag</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOLPUART0WK</name>
                                    <description>no lpuart0 wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPUART0WK</name>
                                    <description>lpuart0 wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPUART1WKF: lpuart1 wakeup flag-->
                        <field>
                            <name>LPU1WKF</name>
                            <description>lpuart1 wakeup flag</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOLPUART1WK</name>
                                    <description>no lpuart1 wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPUART1WK</name>
                                    <description>lpuart1 wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--I2CWKF: i2c wakeup flag-->
                        <field>
                            <name>I2CWKF</name>
                            <description>i2c wakeup flag</description>
                            <bitRange>[23:23]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOI2CWK</name>
                                    <description>no i2c wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2CWK</name>
                                    <description>i2c wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--IOWKF: io wakeup flag-->
                        <field>
                            <name>IOWKF</name>
                            <description>io wakeup flag</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOIOWK</name>
                                    <description>no io wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IOWK</name>
                                    <description>io wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VREFWKF: vref wakeup flag-->
                        <field>
                            <name>VREFWKF</name>
                            <description>vref wakeup flag</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOVREFWK</name>
                                    <description>no vref wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>VREFWK</name>
                                    <description>vref wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LFDETWKF: lfdet wakeup flag-->
                        <field>
                            <name>LFDETWKF</name>
                            <description>lfdet wakeup flag</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOLFDETWK</name>
                                    <description>no lfdet wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LFDETWK</name>
                                    <description>lfdet wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SVDWKF: svd wakeup flag-->
                        <field>
                            <name>SVDWKF</name>
                            <description>svd wakeup flag</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOSVDWK</name>
                                    <description>no svd wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SVDWK</name>
                                    <description>svd wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RTCWKF: rtc wakeup flag-->
                        <field>
                            <name>RTCWKF</name>
                            <description>rtc wakeup flag</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORTCWK</name>
                                    <description>no rtc wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCWK</name>
                                    <description>rtc wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ADCWKF: adc wakeup flag-->
                        <field>
                            <name>ADCWKF</name>
                            <description>adc wakeup flag</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOADCWK</name>
                                    <description>no adc wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADCWK</name>
                                    <description>adc wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
