zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--IER: Low Power IE Register -->
                <register>
                    <name>IER</name>
                    <description>low power IE register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SLPEIE-->
                        <field>
                            <name>SLPEIE</name>
                            <description>sleep error interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable Sleep error interrupt</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>Enable sleep error interrupt</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPACTEIE-->
                        <field>
                            <name>LPACTEIE</name>
                            <description>lp active error interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable lp active error interupt</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>lp active error interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--ISR: Low Power IF Register -->
                <register>
                    <name>ISR</name>
                    <description>low power interrupt flag register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SLPEIF-->
                        <field>
                            <name>SLPEIF</name>
                            <description>sleep error interrupt error</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLPE_OK</name>
                                    <description>go into sleep ok</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLPE_ERR</name>
                                    <description>go into sleep error</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPACTEIF-->
                        <field>
                            <name>LPACTEIF</name>
                            <description>go into lp active error flag</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LPACTIVE_OK</name>
                                    <description>go into lp active ok</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPACTIVE_ERROR</name>
                                    <description>go into lp active error</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                       
                    </fields>
                </register>
            </registers>
        </peripheral>
         <!--PMU_VREF-->
        <peripheral>
            <name>PMU_VREF</name>
            <description>POWER VERF MANAGEMENT UNIT</description>
            <groupName>PMU</groupName>
            <baseAddress>0x4001280C</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x0C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--CR: VREF Control Register-->
                <register>
                    <name>CR</name>
                    <description>Low Power VERF Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>VREF Enable </description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>Vref1p2 Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>Vref1p2 Enable</description>
                                    <value>1</value>
                                </enumeratedValue>            
                            </enumeratedValues>
                        </field>                                              
                    </fields>
                </register>
                <!--SR: VREF Status Register-->
                <register>
                    <name>SR</name>
                    <description>VREF1p22 FLAG Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IF:VREF Ready Flag-->
                        <field>
                            <name>if</name>
                            <description>VREF Ready Flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>no set</name>
                                    <description>VREF1p22 is not set</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>set</name>
                                    <description>VREF1p22 is set</description>
                                    <value>1</value>
                                </enumeratedValue>                               
                            </enumeratedValues>
                        </field>     
                         <!--RDY:VREF Ready -->
                        <field>
                            <name>RDY</name>
                            <description>VREF Ready</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>no set</name>
                                    <description>VREF1p22 is not set</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>set</name>
                                    <description>VREF1p22 is set</description>
                                    <value>1</value>
                                </enumeratedValue>                               
                            </enumeratedValues>
                        </field>    
                         <!--FLAG_B:VREF stable Flag from analog -->
                        <field>
                            <name>FLAG_B</name>
                            <description>VVREF stable Flag from analog</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>no set</name>
                                    <description>VREF1p22 is not set</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>set</name>
                                    <description>VREF1p22 is set</description>
                                    <value>1</value>
                                </enumeratedValue>                               
                            </enumeratedValues>
                        </field>                                                            
                    </fields>
                </register>
                <!--IER:  VREF Interrupt Enable Register -->
                <register>
                    <name>IER</name>
                    <description>IVREF Interrupt Enable Register </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>        
                        <!--IE: VREF Interrupt Enable Register-->
                        <field>
                            <name>IE</name>
                            <description>VREF Interrupt Enable Register</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>Interrupt Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>Interrupt Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                    
                    </fields>
                </register>               
