zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
        <!--PMU_BUF-->
        <peripheral>
            <name>PMU_BUF</name>
            <description>POWER VERF MANAGEMENT UNIT</description>
            <groupName>PMU</groupName>
            <baseAddress>0x40012818</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x04</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--CR: Buffer Control Register-->
                <register>
                    <name>CR</name>
                    <description>Buffer Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--VREFBUFFER_EN-->
                        <field>
                            <name>VREFBUFFER_EN</name>
                            <description>VREFBUFFER Enable </description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>VREFBUFFER Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>VREFBUFFER Enable</description>
                                    <value>1</value>
                                </enumeratedValue>            
                            </enumeratedValues>
                        </field>    
                         <!--VREFBUFFER_OUTEN-->
                        <field>
                            <name>VREFBUFFER_OUTEN</name>
                            <description>VREFBUFFER OUTPUT Enable </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>VREFBUFFER OUTPUT Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>VREFBUFFER OUTPUT Enable</description>
                                    <value>1</value>
                                </enumeratedValue>            
                            </enumeratedValues>
                        </field>  
                         <!--VPTATBUFFER_EN-->
                        <field>
                            <name>VPTATBUFFER_EN</name>
                            <description>VPTATBUFFER Enable </description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>VPTATBUFFER Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>VPTATBUFFER Enable</description>
                                    <value>1</value>
                                </enumeratedValue>            
                            </enumeratedValues>
                        </field>        
                         <!--VPTATBUFFER_OUTEN-->
                        <field>
                            <name>VPTATBUFFER_OUTEN</name>
                            <description>VPTATBUFFER OUTPUT Enable </description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>VPTATBUFFER OUTPUT Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>VPTATBUFFER OUTPUT Enable</description>
                                    <value>1</value>
                                </enumeratedValue>            
                            </enumeratedValues>
                        </field>   
                         <!--VREFPTAT_EN-->
                        <field>
                            <name>VREFPTAT_EN</name>
                            <description>PTAT VREF Enable </description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>PTAT VREF Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enable</name>
                                    <description>PTAT VREF Enable</description>
                                    <value>1</value>
                                </enumeratedValue>            
                            </enumeratedValues>
                        </field>                                                                                                                       
                    </fields>
                </register>                          
