zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--SYSCLK_CR: system clock select Register -->
                <register>
                    <name>SYSCLK_CR</name>
                    <description>system clock select Register </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000000</resetValue>
                    <fields>
                        <!--SYSCLKSEL-->
                        <field>
                            <name>SYSCLKSEL</name>
                            <description>System clock select bit</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>system clock source is RCHF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF</name>
                                    <description>system clock source is XHTF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL</name>
                                    <description>system clock source is PLL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>system clock source is RCHF</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4MPSC</name>
                                    <description>system clock source is RC4MPSC</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>system clock source is LSCLK</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>system clock source is LSCLK</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>system clock source is LSCLK</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--STCLKSEL-->
                        <field>
                            <name>STCLKSEL</name>
                            <description>systick clock select bit</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SCLK</name>
                                    <description>systick clock is sclk</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>systick clock is lsclk</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M</name>
                                    <description>systick clock is rc4m</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSCLK</name>
                                    <description>systick clock is sysclk</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--AHBPRES-->
                        <field>
                            <name>AHBPRES</name>
                            <description>AHB clk divide</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>AHB clock is divided by 2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>AHB clock is divided by 4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>AHB clock is divided by 8</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>AHB clock is divided by 16</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--APBPRES-->
                        <field>
                            <name>APBPRES</name>
                            <description>APB clk divide</description>
                            <bitRange>[18:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>APB clock is divided by 2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>APB clock is divided by 4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>AHB clock is divided by 8</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>AHB clock is divided by 16</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLP_ENEXTI-->
                        <field>
                            <name>SLP_ENEXTI</name>
                            <description>EXTI sample clk enable bit ,at sleep/deepsleep mode</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI sample clk disable </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI sample clk enable </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LSCATS-->
                        <field>
                            <name>LSCATS</name>
                            <description>lsclk auto select config</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>lsclk_change_auto_dis</name>
                                    <description>lsclk auto select disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>lsclk_change_auto_en</name>
                                    <description>lsclk auto select enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RCHF_CR: RCHF config Register -->
                <register>
                    <name>RCHF_CR</name>
                    <description>RCHF config Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>RCHF enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RCHF is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RCHF is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FSEL-->
                        <field>
                            <name>FSEL</name>
                            <description>RCHF frequency select</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8MHz</name>
                                    <description>RCHF center frequency is 8MHz</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16MHz</name>
                                    <description>RCHF center frequency is 16MHz</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24MHz</name>
                                    <description>RCHF center frequency is 24MHz</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RC4M_TR-->
                <register>
                    <name>RC4M_TR</name>
                    <description>RC4M trim Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <!--TRIM-->
                        <field>
                            <name>TRIM</name>
                            <description>RC4M trim bit</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
