zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--PLL_CR: PLL Config Register-->
                <register>
                    <name>PLL_CR</name>
                    <description>PLL Config Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x002F0000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>PLL enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>PLL is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>PLL is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--INSEL-->
                        <field>
                            <name>INSEL</name>
                            <description>PLL input clk source select</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>PLL input clk source is RCHF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF</name>
                                    <description>PLL input clk source is XTHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OSEL-->
                        <field>
                            <name>OSEL</name>
                            <description>PLL output select</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>VCO</name>
                                    <description>PLL output is VCO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TWO_VCO</name>
                                    <description>PLL output is two VCO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--REFPRSC-->
                        <field>
                            <name>REFPRSC</name>
                            <description>PLL DIV</description>
                            <bitRange>[6:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>NO_DIV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_2</name>
                                    <description>DIV_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_4</name>
                                    <description>DIV_4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_8</name>
                                    <description>DIV_8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_12</name>
                                    <description>DIV_12</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_16</name>
                                    <description>DIV_16</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_24</name>
                                    <description>DIV_24</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_32</name>
                                    <description>DIV_32</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LOCKED-->
                        <field>
                            <name>LOCKFLAG</name>
                            <description>LOCKFLAG</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UNLOCK</name>
                                    <description>UNLOCK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOCK</name>
                                    <description>LOCK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DB-->
                        <field>
                            <name>DB</name>
                            <description>PLL DB</description>
                            <bitRange>[22:16]</bitRange>
                            <access>read-write</access>                         
                        </field>
                    </fields>
                </register>
                <!--RCLP_CR: RCLP Config Register-->
                <register>
                    <name>RCLP_CR</name>
                    <description>RCLP config Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPM_RCLP_OFF-->
                        <field>
                            <name>LPM_RCLP_OFF</name>
                            <description>sleep_rclp_control</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>sleep_rclp_off_Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>sleep_rclp_off_Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OFF_EN-->
                        <field>
                            <name>OFF_EN</name>
                            <description>RCLP enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RCLP is enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RCLP is disable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RCLP_TR: RCLP TRIM Register-->
                <register>
                    <name>RCLP_TR</name>
                    <description>RCLP TRIM Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <!--RCLP_TR-->
                        <field>
                            <name>RCLP_TR</name>
                            <description>RCLP TRIM bit</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCLP TRIM_MIN</name>
                                    <description>RCLP TRIM_MIN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP TRIM_MAX</name>
                                    <description>RCLP TRIM_MAX</description>
                                    <value>255</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--XTLF_CR: XTLF Config Register-->
                <register>
                    <name>XTLF_CR</name>
                    <description>XTLF IPW Config Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IPW-->
                        <field>
                            <name>IPW</name>
                            <description>XTLF IPW bit</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>450 nA</name>
                                    <description>XTLF IPW is 450 nA</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>400 nA</name>
                                    <description>XTLF IPW is 400 nA</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>350 nA</name>
                                    <description>XTLF IPW is 350 nA</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>300 nA</name>
                                    <description>XTLF IPW is 300 nA</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>250 nA</name>
                                    <description>XTLF IPW is 250 nA</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>200 nA</name>
                                    <description>XTLF IPW is 200 nA</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>150 nA</name>
                                    <description>XTLF IPW is 150 nA</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100 nA</name>
                                    <description>XTLF IPW is 100 nA</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>XTLFEN bit</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>XTLF DISABLE</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>XTLF ENABLE</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                         <!--BKSW-->
                        <field>
                            <name>BKSW</name>
                            <description>BKSW bit</description>
                            <bitRange>[23:16]</bitRange>
                            <access>read-write</access>                          
                        </field>
                    </fields>
                </register>
