zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--XTHF_CR-->
                <register>
                    <name>XTHF_CR</name>
                    <description>XTHF_CR</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>XTHF_EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>XTHF_DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>XTHF_ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CFG-->
                        <field>
                            <name>CFG</name>
                            <description>XTHF_CONFIG</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTHF_weak_config</name>
                                    <description>XTHF_weak_config</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF_strong_config</name>
                                    <description>XTHF_strong_config</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RC4M_CR-->
                <register>
                    <name>RC4M_CR</name>
                    <description>RC4M_CR</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RC4MEN-->
                        <field>
                            <name>EN</name>
                            <description>RC4M_EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RC4M_DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RC4M_ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PSC-->
                        <field>
                            <name>PSC</name>
                            <description>RC4M_PSC</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>RC4M_NO_DIV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_4</name>
                                    <description>RC4M_DIV_4</description>
                                    <value>1</value>
                                </enumeratedValue>
                                 <enumeratedValue>
                                    <name>DIV_8</name>
                                    <description>RC4M_DIV_8</description>
                                    <value>2</value>
                                </enumeratedValue>
                                 <enumeratedValue>
                                    <name>DIV_16</name>
                                    <description>RC4M_DIV_16</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RCHF_TR-->
                <register>
                    <name>RCHF_TR</name>
                    <description>RCHFTRIM</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <!--TRIM-->
                        <field>
                            <name>TRIM</name>
                            <description>RCHF_TRIM</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--OPC_CR1-->
                <register>
                    <name>OPC_CR1</name>
                    <description>OPC_CR1</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--UART0 clock select-->
                        <field>
                            <name>UART0CKS</name>
                            <description>UART0 clock select</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APBCLK</name>
                                    <description>UART0 clock select APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>UART0 clock select RCHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSCLK</name>
                                    <description>UART0 clock select SYSCLK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_PSC</name>
                                    <description>UART0 clock select RC4M_PSC</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--UART1 clock select-->
                        <field>
                            <name>UART1CKS</name>
                            <description>UART1 clock select</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APBCLK</name>
                                    <description>UART1 clock select APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>UART1 clock select RCHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSCLK</name>
                                    <description>UART1 clock select SYSCLK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_PSC</name>
                                    <description>UART1 clock select RC4M_PSC</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--UART0 clock en-->
                        <field>
                            <name>UART0CKE</name>
                            <description>UART0 clock en</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>UART0 clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>UART0 clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--UART1 clock en-->
                        <field>
                            <name>UART1CKE</name>
                            <description>UART1 clock en</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>UART1 clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>UART1 clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--I2C clock select-->
                        <field>
                            <name>I2CCKS</name>
                            <description>I2C clock select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APBCLK</name>
                                    <description>I2C clock select APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>I2C clock select RCHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSCLK</name>
                                    <description>I2C clock select SYSCLK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_PSC</name>
                                    <description>I2C clock select RC4M_PSC</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BEEP clock select-->
                        <field>
                            <name>BEEPCKS</name>
                            <description>BEEP clock select</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>BEEP clock select APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>BEEP clock select RCHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--I2C clock en-->
                        <field>
                            <name>I2CCKE</name>
                            <description>I2C clock en</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>I2C clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>I2C clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BEEP clock en-->
                        <field>
                            <name>BEEPCKE</name>
                            <description>BEEP clock en</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>BEEP clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>BEEP clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPUART0 clock select-->
                        <field>
                            <name>LPUART0CKS</name>
                            <description>LPUART0 clock select</description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>LPUART0 clock select LSCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF_DIV</name>
                                    <description>LPUART0 clock select RCHF_DIV</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_DIV</name>
                                    <description>LPUART0 clock select RC4M_DIV</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPUART1 clock select-->
                        <field>
                            <name>LPUART1CKS</name>
                            <description>LPUART1 clock select</description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>LPUART1 clock select LSCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF_DIV</name>
                                    <description>LPUART1 clock select RCHF_DIV</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_DIV</name>
                                    <description>LPUART1 clock select RC4M_DIV</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPUART0 clock en-->
                        <field>
                            <name>LPUART0CKE</name>
                            <description>LPUART0 clock en</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LPUART0 clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LPUART0 clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPUART1 clock en-->
                        <field>
                            <name>LPUART1CKE</name>
                            <description>LPUART1 clock en</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LPUART1 clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LPUART1 clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI clock select-->
                        <field>
                            <name>EXTICKS</name>
                            <description>EXTI clock select</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HCLK</name>
                                    <description>EXTI clock select HCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>EXTI clock select LSCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI clock en-->
                        <field>
                            <name>EXTICKE</name>
                            <description>EXTI clock en</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
