zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--OPC_CR2-->
                <register>
                    <name>OPC_CR2</name>
                    <description>OPC_CR2</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BT clock select-->
                        <field>
                            <name>BTCKS</name>
                            <description>BT clock select</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APBCLK</name>
                                    <description>BT clock select APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>BT clock select LSCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>BT clock select RCLP</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_PSC</name>
                                    <description>BT clock select RC4M_PSC</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BT clock en-->
                        <field>
                            <name>BTCKE</name>
                            <description>BT clock en</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>BT clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>BT clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPT clock select-->
                        <field>
                            <name>LPTCKS</name>
                            <description>LPT clock select</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APBCLK</name>
                                    <description>LPT clock select APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>LPT clock select LSCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>LPT clock select RCLP</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M_PSC</name>
                                    <description>LPT clock select RC4M_PSC</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPT clock en-->
                        <field>
                            <name>LPTCKE</name>
                            <description>LPT clock en</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LPT clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LPT clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ADC clock select-->
                        <field>
                            <name>ADCCKS</name>
                            <description>ADC clock select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RC4M_PSC</name>
                                    <description>ADC clock select RC4M_PSC</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>ADC clock select RCHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF</name>
                                    <description>ADC clock select XTHF</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL</name>
                                    <description>ADC clock select PLL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ADC clock en-->
                        <field>
                            <name>ADCCKE</name>
                            <description>ADC clock en</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ADC clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ADC clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RNG clock en-->
                        <field>
                            <name>RNGCKE</name>
                            <description>RNG clock en</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RNG clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RNG clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FLS clock en-->
                        <field>
                            <name>FLSCKE</name>
                            <description>FLS clock en</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>NVM clock DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>NVM clock ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ADC clock psc-->
                        <field>
                            <name>ADCPRSC</name>
                            <description>ADC clock psc</description>
                            <bitRange>[26:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>ADC clock NO_DIV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_2</name>
                                    <description>ADC clock DIV_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_4</name>
                                    <description>ADC clock DIV_4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_8</name>
                                    <description>ADC clock DIV_8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_16</name>
                                    <description>ADC clock DIV_16</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_32</name>
                                    <description>ADC clock DIV_32</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RNG clock psc-->
                        <field>
                            <name>RNGPRSC</name>
                            <description>RNG clock psc</description>
                            <bitRange>[30:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>RNG clock NO_DIV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_2</name>
                                    <description>RNG clock DIV_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_4</name>
                                    <description>RNG clock DIV_4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_8</name>
                                    <description>RNG clock DIV_8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_16</name>
                                    <description>RNG clock DIV_16</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_32</name>
                                    <description>RNG clock DIV_32</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
