zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--CH7_FLSAD:  DMA channel7 flash address Register-->
                <register>
                    <name>CH7_FLSAD</name>
                    <description>DMA channel7 flash address Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH7FLSAD-->
                        <field>
                            <name>CH7FLSAD</name>
                            <description>CH7 flash address</description>
                            <bitRange>[14:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH7_RAMAD:  DMA channel7 RAM address Register-->
                <register>
                    <name>CH7_RAMAD</name>
                    <description>DMA channel7 RAM address Register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH7RAMAD-->
                        <field>
                            <name>CH7RAMAD</name>
                            <description>CH7 RAM address</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ISR: DMA status Register-->
                <register>
                    <name>ISR</name>
                    <description>DMA status Register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CHHT0-->
                        <field>
                            <name>CHHT0</name>
                            <description>channel0 half transmit status bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel0 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel0 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT1-->
                        <field>
                            <name>CHHT1</name>
                            <description>channel1 half transmit status bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel1 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel1 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT2-->
                        <field>
                            <name>CHHT2</name>
                            <description>channel2 half transmit status bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel1 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel1 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT3-->
                        <field>
                            <name>CHHT3</name>
                            <description>channel3 half transmit status bit</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel3 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel3 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT4-->
                        <field>
                            <name>CHHT4</name>
                            <description>channel4 half transmit status bit</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel4 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel4 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT5-->
                        <field>
                            <name>CHHT5</name>
                            <description>channel5 half transmit status bit</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel5 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel5 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT6-->
                        <field>
                            <name>CHHT6</name>
                            <description>channel6 half transmit status bit</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel6 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel6 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHHT7-->
                        <field>
                            <name>CHHT7</name>
                            <description>channel7 half transmit status bit</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel7 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel7 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT0-->
                        <field>
                            <name>CHFT0</name>
                            <description>channel0 transmit status bit</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel0 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel0 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT1-->
                        <field>
                            <name>CHFT1</name>
                            <description>channel1 transmit status bit</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel1 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel1 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT2-->
                        <field>
                            <name>CHFT2</name>
                            <description>channel2 transmit status bit</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel2 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel2 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT3-->
                        <field>
                            <name>CHFT3</name>
                            <description>channel3 transmit status bit</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel3 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel3 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT4-->
                        <field>
                            <name>CHFT4</name>
                            <description>channel4 transmit status bit</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel4 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel4 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT5-->
                        <field>
                            <name>CHFT5</name>
                            <description>channel5 transmit status bit</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel5 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel5 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT6-->
                        <field>
                            <name>CHFT6</name>
                            <description>channel6 transmit status bit</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel6 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel6 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHFT7-->
                        <field>
                            <name>CHFT7</name>
                            <description>channel7 transmit status bit</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel7 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel7 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
