zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
        <!--SPI1-->
        <peripheral>
            <name>SPI1</name>
            <description>SPI Serial Peripheral Interface</description>
            <groupName>SPI</groupName>
            <baseAddress>0x40010840</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI1</name>
                <value>7</value>
            </interrupt>
            <registers>
                <!--CR1: Control Register1-->
                <register>
                    <name>CR1</name>
                    <description>SPI Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <!--CPHA-->
                        <field>
                            <name>CPHA</name>
                            <description>Clock phase bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIRST</name>
                                    <description>capture at First edge </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SECOND</name>
                                    <description>capture at Second edge </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CPOL-->
                        <field>
                            <name>CPOL</name>
                            <description>Clock polarity bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>Idle clock voltage is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>Idle clock voltage is low</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LSBF-->
                        <field>
                            <name>LSBF</name>
                            <description>Frame format bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MSB</name>
                                    <description>MSB first</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSB</name>
                                    <description>LSB first</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BAUD-->
                        <field>
                            <name>BAUD</name>
                            <description>BAUD setting</description>
                            <bitRange>[5:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>fPCLK /2</name>
                                    <description>only Master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/4</name>
                                    <description>only Master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/8</name>
                                    <description>only Master mode</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/16</name>
                                    <description>only Master mode</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/32</name>
                                    <description>only Master mode</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/64</name>
                                    <description>only Master mode</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/128</name>
                                    <description>only Master mode</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/256</name>
                                    <description>only Master mode</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WAIT-->
                        <field>
                            <name>WAIT</name>
                            <description>WAIT clock setting at master mode,(1+wait) clock</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MM-->
                        <field>
                            <name>MM</name>
                            <description>Master/Slave mode select</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLAVE </name>
                                    <description>slave mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Master</name>
                                    <description>Master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSPA-->
                        <field>
                            <name>SSPA</name>
                            <description>Slave Sending Position Adjustment, Slave MISO</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_ADJUST</name>
                                    <description>NO_AHEAD at slave MISO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK</name>
                                    <description>0.5SCK ahead at slave MISO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MSPA-->
                        <field>
                            <name>MSPA</name>
                            <description>Master Sampling Position Adjustment, Master MISO</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DELAY</name>
                                    <description>NO_DELAY at master MISO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK_DELAY</name>
                                    <description>0.5SCK delay at master MISO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CR2: control Register2-->
                <register>
                    <name>CR2</name>
                    <description>control Register2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000054</resetValue>
                    <fields>
                        <!--SPIEN-->
                        <field>
                            <name>SPIEN</name>
                            <description>SPI enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>SPI disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>SPI enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSNSEN-->
                        <field>
                            <name>SSNSEN</name>
                            <description>SSN controled by software at master mode</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>AUTO_OUTPUT</name>
                                    <description>SSN auto output at master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SOFTWARE</name>
                                    <description>SSN output controled by software at master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSN-->
                        <field>
                            <name>SSN</name>
                            <description>SSN control bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>SSN output is low voltage</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>SSN output is high voltage</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXO-->
                        <field>
                            <name>TXO</name>
                            <description>TX only</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable tx_only mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable tx_only mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXO_AC-->
                        <field>
                            <name>TXO_AC</name>
                            <description>auto clear at tx_only mode enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable auto clear at tx_only mode enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable auto clear at tx_only mode enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSNM-->
                        <field>
                            <name>SSNM</name>
                            <description>SSN keep low/high after sending 8bit data at master mode</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>SSN keep low after sending 8bit data at master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>SSN keep hign after sending 8bit data at master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CMD8b-->
                        <field>
                            <name>CMD8b</name>
                            <description>whether cmd 8 bit</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMD_DLEN</name>
                                    <description>cmd dlen</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMD 8 BIT</name>
                                    <description>cmd 8 bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--HD_RW-->
                        <field>
                            <name>HD_RW</name>
                            <description>HALFDUPLEX WRITE OR READ</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HALFDUPLEX WRITE</name>
                                    <description>HALFDUPLEX WRITE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HALFDUPLEX READ</name>
                                    <description>HALFDUPLEX READ</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--HALFDUPLEX-->
                        <field>
                            <name>HALFDUPLEX</name>
                            <description>transfer mode</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DUPLEX MODE</name>
                                    <description>DUPLEX MODE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HALFDUPLEX MODE</name>
                                    <description>HALFDUPLEX MODE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DLEN-->
                        <field>
                            <name>DLEN</name>
                            <description>data len</description>
                            <bitRange>[10:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8bit</name>
                                    <description>len 8 bit</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16bit</name>
                                    <description>len 16 bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24bit</name>
                                    <description>len 24 bit</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32bit</name>
                                    <description>len 32 bit</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXO-->
                        <field>
                            <name>RXO</name>
                            <description>rx only mode</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable rx only mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable rx only mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DUMMY_EN-->
                        <field>
                            <name>DUMMY_EN</name>
                            <description>DUMMY_EN</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable dummy</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable dummy</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
