zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--CR3: Control Register3-->
                <register>
                    <name>CR3</name>
                    <description>control Register3</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SERRC-->
                        <field>
                            <name>SERRC</name>
                            <description>Slave Error Clear bit,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MERRC-->
                        <field>
                            <name>MERRC</name>
                            <description>Master Error Clear bit,write 1 to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXBFC-->
                        <field>
                            <name>RXBFC</name>
                            <description>Receive Buffer Clear bit,write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXBFC-->
                        <field>
                            <name>TXBFC</name>
                            <description>Transmit Buffer Clear bit,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IER: SPI interrupt enable Register-->
                <register>
                    <name>IER</name>
                    <description>SPI interrupt enable Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>receive interrupt enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RXIE DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RXIE ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>TXIE DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>TXIE ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>error interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ERRIE DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ERRIE ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--ISR: SPI interrupt flag Register-->
                <register>
                    <name>ISR</name>
                    <description>SPI interrupt flag Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00001002</resetValue>
                    <fields>
                        <!--RXBF-->
                        <field>
                            <name>RXBF</name>
                            <description>RX Buffer Full,read RXBUF clear this bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RXBF_EMPTY</name>
                                    <description>rx buff empty</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXBF_FULL</name>
                                    <description>rx buff full</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXBE-->
                        <field>
                            <name>TXBE</name>
                            <description>TX Buffer Empty,write TXBUF clear this bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TXBE_FULL</name>
                                    <description>tx buff full</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXBE_EMPTY</name>
                                    <description>tx buff empty</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SERR-->
                        <field>
                            <name>SERR</name>
                            <description>Slave Error Flag</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_SERR</name>
                                    <description>no_serr</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SERR</name>
                                    <description>serr</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MERR-->
                        <field>
                            <name>MERR</name>
                            <description>Master Error Flag</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_MERR</name>
                                    <description>no_merr</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MERR</name>
                                    <description>merr</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>busy flag</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_BUSY</name>
                                    <description>no_busy</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUSY</name>
                                    <description>busy</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXCOL-->
                        <field>
                            <name>TXCOL</name>
                            <description>TX Buffer overflow,write 1 to clear</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_TXOV</name>
                                    <description>NO_TXOV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXOV</name>
                                    <description>TXOV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXCOL-->
                        <field>
                            <name>RXCOL</name>
                            <description>RX Buffer overflow,write 1 to clear</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_RXOV</name>
                                    <description>NO_RXOV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXOV</name>
                                    <description>RXOV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DCN_TX-->
                        <field>
                            <name>DCN_TX</name>
                            <description>DCN_TX MODE</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMD</name>
                                    <description>DCN_CMD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DATA</name>
                                    <description>DCN_DATA</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SPI_TXBUF: SPI TX buffer Register-->
                <register>
                    <name>SPI_TXBUF</name>
                    <description>SPI TX buffer Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXBUF-->
                        <field>
                            <name>TXBUF</name>
                            <description>TXBUF 8BIT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!--SPI_RXBUF: SPI RX buffer Register-->
                <register>
                    <name>SPI_RXBUF</name>
                    <description>SPI RX buffer Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXBUF-->
                        <field>
                            <name>RXBUF</name>
                            <description>RXBUF 8bit</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
