zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--DFS: Portx Digital Function Select register -->
                <register>
                    <name>DFS</name>
                    <description>Portx Digital Function Select register </description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DFS-->
                        <field>
                            <name>DFS</name>
                            <description>Portx Digital Function Select </description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--HD-->
                <register>
                    <name>HD</name>
                    <description>HD</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--HD-->
                        <field>
                            <name>HD</name>
                            <description>Portx High Drive Enable </description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                 <!--ANEN-->
                <register>
                    <name>ANEN</name>
                    <description>ANEN</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ANEN-->
                        <field>
                            <name>ANEN</name>
                            <description>Portx Analog channel Enable </description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--GPIOB-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40000C40</baseAddress>
        </peripheral>
        <!--GPIOC-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40000C80</baseAddress>
        </peripheral>
        <!--GPIOD-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40000CC0</baseAddress>
        </peripheral>
        <!--GPIO_COMMON-->
        <peripheral>
            <name>GPIO_COMMON</name>
            <description>GPIO_COMMON Registers</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x40000D00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x0300</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>GPIO</name>
                <value>30</value>
            </interrupt>
            <registers>
                <!--EXTI_SEL: GPIO EXTI Select -->
                <register>
                    <name>EXTI_SEL</name>
                    <description>GPIO EXTI Select 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI0-->
                        <field>
                            <name>EXTI0</name>
                            <description>EXTI0[0] input pin select</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA0</name>
                                    <description>EXTI0[0] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA1</name>
                                    <description>EXTI0[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA2</name>
                                    <description>EXTI0[0]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA3</name>
                                    <description>EXTI0[0] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1-->
                        <field>
                            <name>EXTI1</name>
                            <description>EXTI[1] input pin select</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA4</name>
                                    <description>EXTI[1]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA5</name>
                                    <description>EXTI[1] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA6</name>
                                    <description>EXTI[1]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA7</name>
                                    <description>EXTI[1]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2-->
                        <field>
                            <name>EXTI2</name>
                            <description>EXTI[2] input pin select</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA8</name>
                                    <description>EXTI[2]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA9</name>
                                    <description>EXTI[2] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA10</name>
                                    <description>EXTI[2]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA11</name>
                                    <description>EXTI[2]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI3-->
                        <field>
                            <name>EXTI3</name>
                            <description>EXTI[3] input pin select</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA12</name>
                                    <description>EXTI[3]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA13</name>
                                    <description>EXTI[3] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA14</name>
                                    <description>EXTI[3]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA15</name>
                                    <description>EXTI[3]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL4-->
                        <field>
                            <name>EXTI0_SEL4</name>
                            <description>EXTI0[4] input pin select</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PB0</name>
                                    <description>EXTI0[4]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB1</name>
                                    <description>EXTI0[4] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>B2</name>
                                    <description>EXTI0[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB3</name>
                                    <description>EXTI0[4]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL5-->
                        <field>
                            <name>EXTI0_SEL5</name>
                            <description>EXTI0[5] input pin select</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PB4</name>
                                    <description>EXTI0[5]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB5</name>
                                    <description>EXTI0[5] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB6</name>
                                    <description>EXTI0[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB7</name>
                                    <description>EXTI0[5]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL6-->
                        <field>
                            <name>EXTI0_SEL6</name>
                            <description>EXTI0[6] input pin select</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PB8</name>
                                    <description>EXTI0[6]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB9</name>
                                    <description>EXTI0[6] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB10</name>
                                    <description>EXTI0[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB11</name>
                                    <description>EXTI0[6]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL7-->
                        <field>
                            <name>EXTI0_SEL7</name>
                            <description>EXTI0[7] input pin select</description>
                            <bitRange>[15:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PB12</name>
                                    <description>EXTI0[7]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB13</name>
                                    <description>EXTI0[7] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB14</name>
                                    <description>EXTI0[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB15</name>
                                    <description>EXTI0[7]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL8-->
                        <field>
                            <name>EXTI0_SEL8</name>
                            <description>EXTI0[8] input pin select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC0</name>
                                    <description>EXTI0[8] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC1</name>
                                    <description>EXTI0[8]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC2</name>
                                    <description>EXTI0[8]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC3</name>
                                    <description>EXTI0[8] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL9-->
                        <field>
                            <name>EXTI0_SEL9</name>
                            <description>EXTI0[9] input pin select</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC4</name>
                                    <description>EXTI0[9] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC5</name>
                                    <description>EXTI0[9]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC6</name>
                                    <description>EXTI0[9]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC7</name>
                                    <description>EXTI0[9] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL10-->
                        <field>
                            <name>EXTI0_SEL10</name>
                            <description>EXTI0[10] input pin select</description>
                            <bitRange>[21:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC8</name>
                                    <description>EXTI0[10] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC9</name>
                                    <description>EXTI0[10]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC10</name>
                                    <description>EXTI0[10]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC11</name>
                                    <description>EXTI0[10] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL12-->
                        <field>
                            <name>EXTI0_SEL12</name>
                            <description>EXTI0[12] input pin select</description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PD0</name>
                                    <description>EXTI0[12] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD1</name>
                                    <description>EXTI0[12]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD2</name>
                                    <description>EXTI0[12]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD3</name>
                                    <description>EXTI0[12] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL13-->
                        <field>
                            <name>EXTI0_SEL13</name>
                            <description>EXTI0[13] input pin select</description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PD4</name>
                                    <description>EXTI0[13] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD5</name>
                                    <description>EXTI0[13]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD6</name>
                                    <description>EXTI0[13]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD7</name>
