zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                                    <description>EXTI0[13] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI_SEL14-->
                        <field>
                            <name>EXTI0_SEL14</name>
                            <description>EXTI0[14] input pin select</description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PD8</name>
                                    <description>EXTI0[14] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD9</name>
                                    <description>EXTI0[14]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD10</name>
                                    <description>EXTI0[14]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD11</name>
                                    <description>EXTI0[14] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--EXTI_EDS-->
                <register>
                    <name>EXTI_EDS</name>
                    <description>GPIO EXTI Edge Select </description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <!--EXTI0_EDS-->
                        <field>
                            <name>EXTI0_EDS</name>
                            <description>GPIO EXTI0 Edge Select </description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS-->
                        <field>
                            <name>EXTI1_EDS</name>
                            <description>GPIO EXTI1 Edge Select </description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS-->
                        <field>
                            <name>EXTI2_EDS</name>
                            <description>GPIO EXTI2 Edge Select </description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI3_EDS-->
                        <field>
                            <name>EXTI3_EDS</name>
                            <description>GPIO EXTI3 Edge Select </description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI4_EDS-->
                        <field>
                            <name>EXTI4_EDS</name>
                            <description>GPIO EXTI4 Edge Select </description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI5_EDS-->
                        <field>
                            <name>EXTI5_EDS</name>
                            <description>GPIO EXTI5 Edge Select </description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI6_EDS-->
                        <field>
                            <name>EXTI6_EDS</name>
                            <description>GPIO EXTI6 Edge Select </description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI7_EDS-->
                        <field>
                            <name>EXTI7_EDS</name>
                            <description>GPIO EXTI7 Edge Select </description>
                            <bitRange>[15:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI8_EDS-->
                        <field>
                            <name>EXTI8_EDS</name>
                            <description>GPIO EXTI8 Edge Select </description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI9_EDS-->
                        <field>
                            <name>EXTI9_EDS</name>
                            <description>GPIO EXTI9 Edge Select </description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI10_EDS-->
                        <field>
                            <name>EXTI10_EDS</name>
                            <description>GPIO EXTI10 Edge Select </description>
                            <bitRange>[21:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI11_EDS-->
                        <field>
                            <name>EXTI11_EDS</name>
                            <description>GPIO EXTI11 Edge Select </description>
                            <bitRange>[23:22]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI12_EDS-->
                        <field>
                            <name>EXTI12_EDS</name>
                            <description>GPIO EXTI12 Edge Select </description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI13_EDS-->
                        <field>
                            <name>EXTI13_EDS</name>
                            <description>GPIO EXTI13 Edge Select </description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
