zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI14_EDS-->
                        <field>
                            <name>EXTI14_EDS</name>
                            <description>GPIO EXTI14 Edge Select </description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI15_EDS-->
                        <field>
                            <name>EXTI15_EDS</name>
                            <description>GPIO EXTI15 Edge Select </description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rising</name>
                                    <description>rising</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>falling</name>
                                    <description>falling</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>both</name>
                                    <description>both</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disable</name>
                                    <description>disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--EXTI_DF-->
                <register>
                    <name>EXTI_DF</name>
                    <description>GPIO EXTI Digital Filter</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI0_DF-->
                        <field>
                            <name>EXTI0_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_DF-->
                        <field>
                            <name>EXTI1_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_DF-->
                        <field>
                            <name>EXTI2_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI3_DF-->
                        <field>
                            <name>EXTI3_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI4_DF-->
                        <field>
                            <name>EXTI4_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI5_DF-->
                        <field>
                            <name>EXTI5_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI6_DF-->
                        <field>
                            <name>EXTI6_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI7_DF-->
                        <field>
                            <name>EXTI7_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI8_DF-->
                        <field>
                            <name>EXTI8_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI9_DF-->
                        <field>
                            <name>EXTI9_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI10_DF-->
                        <field>
                            <name>EXTI10_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI11_DF-->
                        <field>
                            <name>EXTI11_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI12_DF-->
                        <field>
                            <name>EXTI12_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI13_DF-->
                        <field>
                            <name>EXTI13_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI14_DF-->
                        <field>
                            <name>EXTI14_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI15_DF-->
                        <field>
                            <name>EXTI15_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
