zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--EXTI_ISR-->
                <register>
                    <name>EXTI_ISR</name>
                    <description>GPIO EXTI IF</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI0_IF-->
                        <field>
                            <name>EXTI0_IF</name>
                            <description>GPIO EXTI0_IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_IF-->
                        <field>
                            <name>EXTI1_IF</name>
                            <description>GPIO EXTI1_IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_IF-->
                        <field>
                            <name>EXTI2_IF</name>
                            <description>GPIO EXTI2_IF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI3_IF-->
                        <field>
                            <name>EXTI3_IF</name>
                            <description>GPIO EXTI3_IF</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI4_IF-->
                        <field>
                            <name>EXTI4_IF</name>
                            <description>GPIO EXTI4_IF</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI5_IF-->
                        <field>
                            <name>EXTI5_IF</name>
                            <description>GPIO EXTI5_IF</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI6_IF-->
                        <field>
                            <name>EXTI6_IF</name>
                            <description>GPIO EXTI6_IF</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI7_IF-->
                        <field>
                            <name>EXTI7_IF</name>
                            <description>GPIO EXTI7_IF</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI8_IF-->
                        <field>
                            <name>EXTI8_IF</name>
                            <description>GPIO EXTI8_IF</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI9_IF-->
                        <field>
                            <name>EXTI9_IF</name>
                            <description>GPIO EXTI9_IF</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI10_IF-->
                        <field>
                            <name>EXTI10_IF</name>
                            <description>GPIO EXTI10_IF</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI11_DF-->
                        <field>
                            <name>EXTI11_DF</name>
                            <description>GPIO EXTI Digital Filter</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI12_IF-->
                        <field>
                            <name>EXTI12_IF</name>
                            <description>GPIO EXTI12_IF</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI13_IF-->
                        <field>
                            <name>EXTI13_IF</name>
                            <description>GPIO EXTI13_IF</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI14_IF-->
                        <field>
                            <name>EXTI14_IF</name>
                            <description>GPIO EXTI14_IF</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI15_IF-->
                        <field>
                            <name>EXTI15_IF</name>
                            <description>GPIO EXTI15_IF</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
