zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--EXTI_DI-->
                <register>
                    <name>EXTI_DI</name>
                    <description>GPIO EXTI_DI</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI0_DI-->
                        <field>
                            <name>EXTI0_DI</name>
                            <description>GPIO EXTI0_DI</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_DI-->
                        <field>
                            <name>EXTI1_DI</name>
                            <description>GPIO EXTI1_DI</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_DI-->
                        <field>
                            <name>EXTI2_DI</name>
                            <description>GPIO EXTI2_DI</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI3_DI-->
                        <field>
                            <name>EXTI3_DI</name>
                            <description>GPIO EXTI3_DI</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI4_DI-->
                        <field>
                            <name>EXTI4_DI</name>
                            <description>GPIO EXTI4_DI</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI5_DI-->
                        <field>
                            <name>EXTI5_DI</name>
                            <description>GPIO EXTI5_DI</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI6_DI-->
                        <field>
                            <name>EXTI6_DI</name>
                            <description>GPIO EXTI6_DI</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI7_DI-->
                        <field>
                            <name>EXTI7_DI</name>
                            <description>GPIO EXTI7_DI</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI8_DI-->
                        <field>
                            <name>EXTI8_DI</name>
                            <description>GPIO EXTI8_DI</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI9_DI-->
                        <field>
                            <name>EXTI9_DI</name>
                            <description>GPIO EXTI9_DI</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI10_DI-->
                        <field>
                            <name>EXTI10_DI</name>
                            <description>GPIO EXTI10_DI</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI11_DI-->
                        <field>
                            <name>EXTI11_DI</name>
                            <description>GPIO EXTI11_DI</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI12_DI-->
                        <field>
                            <name>EXTI12_DI</name>
                            <description>GPIO EXTI12_DI</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI13_DI-->
                        <field>
                            <name>EXTI13_DI</name>
                            <description>GPIO EXTI13_DI</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI14_DI-->
                        <field>
                            <name>EXTI14_DI</name>
                            <description>GPIO EXTI14_DI</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI15_DI-->
                        <field>
                            <name>EXTI15_DI</name>
                            <description>GPIO EXTI15_DI</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>GPIO EXTI Digital Filter Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>enable</name>
                                    <description>GPIO EXTI Digital Filter Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
