zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--FOUT_SEL: FOUT select -->
                <register>
                    <name>FOUT_SEL</name>
                    <description>FOUT select </description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FOUT0SEL-->
                        <field>
                            <name>FOUT0SEL</name>
                            <description>FOUT0 select</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>FOUT select XTLF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>FOUT select RCLP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF/64</name>
                                    <description>FOUT select  RCHF/64</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>FOUT select LSCLK</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AHBCLK/64</name>
                                    <description>FOUT select AHBCLK/64</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCTM</name>
                                    <description>FOUT select RTCTM</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLO/64</name>
                                    <description>FOUT select PLLO/64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCCLK64Hz</name>
                                    <description>FOUT select  RTCCLK64Hz</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APBCLK/64</name>
                                    <description>FOUT select APBCLK/64</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLO</name>
                                    <description>FOUT select PLLO</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name> RC4MPSC</name>
                                    <description>FOUT select  RC4MPSC</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>RCHF</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF/64</name>
                                    <description>XTHF/64</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADCCLK/64</name>
                                    <description>ADCCLK/64</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLK8K</name>
                                    <description>CLK8K</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FOUT1SEL-->
                        <field>
                            <name>FOUT1SEL</name>
                            <description>FOUT1 select</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>FOUT select XTLF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>FOUT select RCLP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF/64</name>
                                    <description>FOUT select  RCHF/64</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>FOUT select LSCLK</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AHBCLK/64</name>
                                    <description>FOUT select AHBCLK/64</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCTM</name>
                                    <description>FOUT select RTCTM</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLO/64</name>
                                    <description>FOUT select PLLO/64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCCLK64Hz</name>
                                    <description>FOUT select  RTCCLK64Hz</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APBCLK/64</name>
                                    <description>FOUT select APBCLK/64</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLO</name>
                                    <description>FOUT select PLLO</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name> RC4MPSC</name>
                                    <description>FOUT select  RC4MPSC</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>RCHF</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF/64</name>
                                    <description>XTHF/64</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADCCLK/64</name>
                                    <description>ADCCLK/64</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLK8K</name>
                                    <description>CLK8K</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
