zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
        <!--FLS-->
        <peripheral>
            <name>FLS</name>
            <description>NVMIF Registers</description>
            <groupName>NVMIF</groupName>
            <baseAddress>0x40001000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FLS</name>
                <value>3</value>
            </interrupt>
            <registers>
                <!--FLS_RDCR: FLASH read control register-->
                <register>
                    <name>FLS_RDCR</name>
                    <description>FLASH read control register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WAIT-->
                        <field>
                            <name>WAIT</name>
                            <description>wait cycle at flash resd </description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ZERO</name>
                                    <description>0 wait cycle</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONE</name>
                                    <description>1 wait cycle</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TWO</name>
                                    <description>2 wait cycle</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ZERO</name>
                                    <description>0 wait cycle</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                                             
                    </fields>
                </register>                
                <!--FLS_OPTBR: OPTBR-->
                <register>
                    <name>OPTBR</name>
                    <description>OPTBR</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000005</resetValue>
                    <fields>
                        <!--DBRDPEN-->
                        <field>
                            <name>DBRDPEN</name>
                            <description>debug port read protect</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>debug port read protect disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>debug port read protect disable</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>debug port read protect enable</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>debug port read protect disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ACLOCKEN-->
                        <field>
                            <name>ACLOCKEN</name>
                            <description>ACLOCKEN</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ACLOCK DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ACLOCK DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ACLOCK ENABLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ACLOCK DISABLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BTSEN-->
                        <field>
                            <name>BTSEN</name>
                            <description>BootSwap Enable</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                                              
                        <!--DBGCFGEN-->
                        <field>
                            <name>DBGCFGEN</name>
                            <description>DEBUG CONFIG REGISTER ENABLE</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>DEBUG CONFIG REGISTER ENABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DEBUG CONFIG REGISTER DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--FLS_ACLOCK: ACLOCK config reister1-->
                <register>
                    <name>FLS_ACLOCK</name>
                    <description>ACLOCK config reister1</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                </register>
