zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--FLS_EPCR: erase & prog config register-->
                <register>
                    <name>FLS_EPCR</name>
                    <description>erase &amp; prog config register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EREQ-->
                        <field>
                            <name>EREQ</name>
                            <description>Erase Request</description>
                            <bitRange>[0:0]</bitRange>
                            <access>write_only</access>
                        </field>
                        <!--PREQ-->
                        <field>
                            <name>PREQ</name>
                            <description>Program Request</description>
                            <bitRange>[1:1]</bitRange>
                            <access>write-only</access>
                        </field>
                        <!--ERTYPE-->
                        <field>
                            <name>ERTYPE</name>
                            <description>erase tyre</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SECTOR</name>
                                    <description>Sector Erase</description>
                                    <value>0</value>
                                </enumeratedValue>                       
                                <enumeratedValue>
                                    <name>CHIP</name>
                                    <description>Chip Erase</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SECTOR</name>
                                    <description>Sector Erase</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--FLS_KEY:flash key register-->
                <register>
                    <name>FLS_KEY</name>
                    <description>FLASH KEY REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--FLS_IER: FLASH IE-->
                <register>
                    <name>FLS_IER</name>
                    <description>FLASH IE</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ERDIE-->
                        <field>
                            <name>ERDIE</name>
                            <description>ERASE FINISH IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PRDIE-->
                        <field>
                            <name>PRDIE</name>
                            <description>PROG FINISH IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CKIE-->
                        <field>
                            <name>CKIE</name>
                            <description>CLOCK ERR IE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--KEYIE-->
                        <field>
                            <name>KEYIE</name>
                            <description>FLASH KEY ERR IE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--AUTHIE-->
                        <field>
                            <name>AUTHIE</name>
                            <description>AUTH ERR IE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FLS_ISR: FLASH IF-->
                <register>
                    <name>FLS_ISR</name>
                    <description>FLASH IF</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ERD-->
                        <field>
                            <name>ERD</name>
                            <description>ERASE DONE IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PRD-->
                        <field>
                            <name>PRD</name>
                            <description>PROG DONE IF  </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CKERR-->
                        <field>
                            <name>CKERR</name>
                            <description>CLK ERR IF</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--KEYERR-->
                        <field>
                            <name>KEYERR</name>
                            <description>KEY ERR IF</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--AUTHERR-->
                        <field>
                            <name>AUTHERR</name>
                            <description>AUTH ERR IF</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--BTSF-->
                        <field>
                            <name>BTSF</name>
                            <description>BootSwap FLAG</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BOOT_0000H</name>
                                    <description>BOOT_0000H</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BOOT_2000H</name>
                                    <description>BOOT_2000H</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--KEYSTA-->
                        <field>
                            <name>KEYSTA</name>
                            <description>KEY STATE</description>
                            <bitRange>[19:17]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IDLE</name>
                                    <description>IDLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CHIP_ERASE_UNLOCK</name>
                                    <description>CHIP_ERASE_UNLOCK</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SECTOR_ERASE_UNLOCK</name>
                                    <description>SECTOR_ERASE_UNLOCK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PROG_UNLOCK</name>
                                    <description>PROG_UNLOCK</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>KEY_ERR</name>
                                    <description>KEY_ERR</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>               
