zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>    
        </peripheral>  
         <!--CRC-->
        <peripheral>
            <name>CRC</name>
            <description>CRC</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40010000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--CRC_DR: CRC DATA REGISTER-->
                <register>
                    <name>CRC_DR</name>
                    <description>CRC DATA REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <!--DR-->
                        <field>
                            <name>DR</name>
                            <description>CRCDR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>                         
                        </field>
                    </fields>
                </register>
                <!--CRC_CR: CRC CONTROL REGISTER-->
                <register>
                    <name>CRC_CR</name>
                    <description>CRC CONTROL REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--CRCSEL-->
                        <field>
                            <name>SEL</name>
                            <description>MODE SELECT</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRC32</name>
                                    <description>CRC32</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC16</name>
                                    <description>CRC16</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC8</name>
                                    <description>CRC8</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC7</name>
                                    <description>CRC7</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--XOR-->
                        <field>
                            <name>XOR</name>
                            <description>OUTPUT XOR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--RES-->
                        <field>
                            <name>RES</name>
                            <description>result is zero</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--RFLTO-->
                        <field>
                            <name>RFLTO</name>
                            <description>output reverse</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RFLTIN-->
                        <field>
                            <name>RFLTIN</name>
                            <description>input reverse</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO-REFLECT</name>
                                    <description>NO-REFLECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BYTE-REFLECT</name>
                                    <description>BYTE-REFLECT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HALF_WORD_REFLECT</name>
                                    <description>HALF_WORD_REFLECT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WORD_REFLECT</name>
                                    <description>WORD_REFLECT</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PARA-->
                        <field>
                            <name>PARA</name>
                            <description>PARA</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OPWD-->
                        <field>
                            <name>OPWD</name>
                            <description>WORD_OPRATE_EN</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
