zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--CRC_LFSR: CRC LFSR REGISTER-->
                <register>
                    <name>CRCLFSR</name>
                    <description>CRC LFSR REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <!--LFSR-->
                        <field>
                            <name>LFSR</name>
                            <description>LFSR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRC_XOR: CRC XOR REGISTER-->
                <register>
                    <name>CRC_XOR</name>
                    <description>CRC XOR REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCXOR-->
                        <field>
                            <name>CRCXOR</name>
                            <description>CRC XOR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FLS_CR:FLASH CRC ENABLE-->
                <register>
                    <name>FLS_CR</name>
                    <description>FLASH CRC ENABLE</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSCRCEN-->
                        <field>
                            <name>FLSCRCEN</name>
                            <description>FLASH CRC ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CRC_FLS_AD:FLASH CRC ADDR-->
                <register>
                    <name>CRC_FLS_AD</name>
                    <description>FLASH CRC ADDR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSAD-->
                        <field>
                            <name>FLSAD</name>
                            <description>FLASH CRC ADDR</description>
                            <bitRange>[14:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRC_FLS_SIZE: FLASH CRC SIZE-->
                <register>
                    <name>CRC_FLS_SIZE</name>
                    <description>FLASH CRC SIZE</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSS-->
                        <field>
                            <name>FLSS</name>
                            <description>SIZE = (FLSS+1)*4</description>
                            <bitRange>[14:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRC_POLY-->
                <register>
                    <name>CRC_POLY</name>
                    <description>CRC POLY</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00001021</resetValue>
                    <fields>
                        <!--POLY-->
                        <field>
                            <name>POLY</name>
                            <description>CRC POLY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
         <!--LPUART-->
        <peripheral>
            <name>LPUART0</name>
            <description>LPUART0 Registers</description>
            <groupName>LPUART</groupName>
            <baseAddress>0x40010400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPUART0</name>
                <value>31</value>
            </interrupt>
            <registers>
                <!--LPU0_CSR:LPUARTx Config-->
                <register>
                    <name>LPUART_CSR</name>
                    <description>LPUART Config</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXEN-->
                        <field>
                            <name>TXEN</name>
                            <description>TX ENable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXEN-->
                        <field>
                            <name>RXEN</name>
                            <description>RX ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXPOL-->
                        <field>
                            <name>TXPOL</name>
                            <description>LPUARTx TXPOL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>UARx TX NORMAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REVERSE</name>
                                    <description>UARx TX REVERSE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXPOL-->
                        <field>
                            <name>RXPOL</name>
                            <description>LPUARTx RXPOL</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>UARx RX NORMAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REVERSE</name>
                                    <description>UARx RX REVERSE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PARITY-->
                        <field>
                            <name>PARITY</name>
                            <description>LPUARTx PARITY</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO PARITY</name>
                                    <description>UARx NO PARITY BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PARITY EVEN</name>
                                    <description>UARx PARITY EVEN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PARITY ODD</name>
                                    <description>UARx PARITY ODD</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PDSEL-->
                        <field>
                            <name>PDSEL</name>
                            <description>LPUART PDSEL</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>7 BIT</name>
                                    <description>UARx 7 BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8 BIT</name>
                                    <description>UARx 8 BIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>9 BIT</name>
                                    <description>UARx 9 BIT</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--STOPSEL-->
                        <field>
                            <name>STOPSEL</name>
                            <description>STOP BIT select</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1BIT</name>
                                    <description>1 STOPBIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2BIT</name>
                                    <description>2 STOPBIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BITORD-->
                        <field>
                            <name>BITORD</name>
                            <description>LPUARTx BITORD</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1BIT</name>
                                    <description>1 STOPBIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2BIT</name>
                                    <description>2 STOPBIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMATXIFCFG-->
                        <field>
                            <name>DMATXIFCFG</name>
                            <description>LPUART DMATXIFCFG</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DEPENDS</name>
                                    <description>DEPENDS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXEV-->
                        <field>
                            <name>RXEV</name>
                            <description>LPUARTx RXEV</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>START</name>
                                    <description>START</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1 BYTE RECEIVE</name>
                                    <description>1 BYTE RECEIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RECEIVE MATCH</name>
                                    <description>RECEIVE MATCH</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXD FALLING</name>
                                    <description>RXD FALLING</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WKBYTECFG-->
                        <field>
                            <name>WKBYTE_CFG</name>
                            <description>LPUARTx WKBYTE_CFG</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT CHECK</name>
                                    <description>NOT CHECK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CHECK</name>
                                    <description>CHECK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>LPUARTx BUSY</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO BUSY</name>
                                    <description>NO BUSY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUSY</name>
                                    <description>BUSY</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
