zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
        <!--LPUART1-->
        <peripheral derivedFrom="LPUART0">
            <name>LPUART1</name>
            <baseAddress>0x40010420</baseAddress>
            <interrupt>
                <name>LPUART1</name>
                <value>16</value>
            </interrupt>
        </peripheral>
        <!--LCD-->
        <peripheral>
            <name>LCD</name>
            <description>LCD Registers</description>
            <groupName>LCD</groupName>
            <baseAddress>0x40010C00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LCD</name>
                <value>9</value>
            </interrupt>
            <registers>
                <!--LCD_CR: DISPLAY CONTROL REGISTER-->
                <register>
                    <name>LCD_CR</name>
                    <description>LCD Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010E00</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LMUX-->
                        <field>
                            <name>LMUX</name>
                            <description>LMUX</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>4COM</name>
                                    <description>4COM</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6COM</name>
                                    <description>6COM</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8COM</name>
                                    <description>8COM</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8COM</name>
                                    <description>8COM</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WFT-->
                        <field>
                            <name>WFT</name>
                            <description>WFT</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>A</name>
                                    <description>A</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>B</name>
                                    <description>B</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ANTIPOLAR-->
                        <field>
                            <name>ANTIPOLAR</name>
                            <description>COM &amp; SEG C0ONNECT TO GND OR FLOATING AT DISP DISABLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FLOATING</name>
                                    <description>FLOATING</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GND</name>
                                    <description>GND</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BIAS-->
                        <field>
                            <name>BIASMD</name>
                            <description>BIASMD</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1/4 BIAS</name>
                                    <description>1/4 BIAS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1/3 BIAS</name>
                                    <description>1/3 BIAS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BIAS-->
                        <field>
                            <name>BIAS</name>
                            <description>LCDBIAS</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--FLICK-->
                        <field>
                            <name>FLICK</name>
                            <description>FLICK</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ENMODE-->
                        <field>
                            <name>ENMODE</name>
                            <description>ENMODE</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OUT CAP EN</name>
                                    <description>OUT CAP EN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IN RES EN</name>
                                    <description>IN RES EN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--IC_CTRL-->
                        <field>
                            <name>IC_CTRL</name>
                            <description>IC_CTRL</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>I_MAX</name>
                                    <description>I_MAX</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I_SECONG_MAX</name>
                                    <description>I_SECONG_MAX</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I_SECONG_MIN</name>
                                    <description>I_SECONG_MIN</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I_MIN</name>
                                    <description>I_MIN</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SC_CTRL-->
                        <field>
                            <name>SC_CTRL</name>
                            <description>SC_CTRL</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DRIVE ONE </name>
                                    <description>DRIVE ONE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DRIVE TWO</name>
                                    <description>DRIVE TWO</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DRIVE FOUR</name>
                                    <description>DRIVE FOUR</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DRIVE MANY TIMES</name>
                                    <description>DRIVE MANY TIMES</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SCFSEL-->
                        <field>
                            <name>SCFSEL</name>
                            <description>SCFSEL</description>
                            <bitRange>[22:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FRAME*COM</name>
                                    <description>FRAME*COM</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/8</name>
                                    <description>disp_clk/8</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/16</name>
                                    <description>disp_clk/16</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/32</name>
                                    <description>disp_clk/32</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/64</name>
                                    <description>disp_clk/64</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/128</name>
                                    <description>disp_clk/128</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/256</name>
                                    <description>disp_clk/256</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>disp_clk/512</name>
                                    <description>disp_clk/512</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LCD_TEST: LCD TEST-->
                <register>
                    <name>LCD_TEST</name>
                    <description>LCD TEST</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TESTEN-->
                        <field>
                            <name>TESTEN</name>
                            <description>EXTI1[0] input pin select</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--LCCTRL-->
                        <field>
                            <name>LCCTRL</name>
                            <description>TEST CONTROL</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCD_FCR: DIVIDED FREQ-->
                <register>
                    <name>LCD_FCR</name>
                    <description>DIVIDED FREQ</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DF-->
                        <field>
                            <name>DF</name>
                            <description>DIVIDED FREQ</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCD_FLKT: FLICK TIME SETTING-->
                <register>
                    <name>LCD_FLKT</name>
                    <description>FLICK TIME SETTING</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TON-->
                        <field>
                            <name>TON</name>
                            <description>FLICK TIME SETTING</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TOFF-->
                        <field>
                            <name>TOFF</name>
                            <description>FLICK TIME SETTING</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCD_IER: DISP IE-->
                <register>
                    <name>LCD_IER</name>
                    <description>DISP IE</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DOFFIE-->
                        <field>
                            <name>DOFFIE</name>
                            <description>DISPLAY OFF IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DONIE-->
                        <field>
                            <name>DONIE</name>
                            <description>DISPLAY ON IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCD_ISR: DISP IF-->
                <register>
                    <name>LCD_ISR</name>
                    <description>DISP IF</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DOFFIF-->
                        <field>
                            <name>DOFFIF</name>
                            <description>DISP OFF IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DONIF-->
                        <field>
                            <name>DONIF</name>
                            <description>DISP ON IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCD_DATA0: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA0</name>
                    <description>DISPLAY DATA REGISTER </description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA1: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA1</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA2: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA2</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
