zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--DISPDATA3: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA3</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA4: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA4</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA5: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA5</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA6: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA6</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA7: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>LCD_DATA7</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--LCD_COM_EN: COM ENABLE-->
                <register>
                    <name>LCD_COM_EN</name>
                    <description>COM ENABLE</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--COMEN 0-3-->
                        <field>
                            <name>COMEN</name>
                            <description>COMEN 0-3</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCD_SEG_EN0: SEG ENABLE-->
                <register>
                    <name>LCDSEG_EN0</name>
                    <description>SEG ENABLE</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SEGEN-->
                        <field>
                            <name>SEGEN</name>
                            <description>SEGEN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--RTC-->
        <peripheral>
            <name>RTC</name>
            <description>RTC Registers</description>
            <groupName>RTC</groupName>
            <baseAddress>0x40011000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC</name>
                <value>2</value>
            </interrupt>
            <registers>
                <!--RTC_WER: RTC WRITE PROTECT REGISTER-->
                <register>
                    <name>RTC_WER</name>
                    <description>RTC WRITE PROTECT REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WE-->
                        <field>
                            <name>WE</name>
                            <description>RTCWE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RTC_IER: RTC IE-->
                <register>
                    <name>RTC_IER</name>
                    <description>RTC IE</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAY_IE-->
                        <field>
                            <name>DAY_IE</name>
                            <description>DAY_IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HOUR_IE-->
                        <field>
                            <name>HOUR_IE</name>
                            <description>HOUR_IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MIN_IE-->
                        <field>
                            <name>MIN_IE</name>
                            <description>MIN_IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SEC_IE-->
                        <field>
                            <name>SEC_IE</name>
                            <description>SEC_IE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--2HZ_IE-->
                        <field>
                            <name>IE_2HZ</name>
                            <description>IE_2HZ</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--4HZ_IE-->
                        <field>
                            <name>IE_4HZ</name>
                            <description>IE_4HZ</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--8HZ_IE-->
                        <field>
                            <name>IE_8HZ</name>
                            <description>IE_8HZ</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--16HZ_IE-->
                        <field>
                            <name>IE_16HZ</name>
                            <description>IE_16HZ</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--64HZ_IE-->
                        <field>
                            <name>IE_64HZ</name>
                            <description>IE_64HZ</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--256HZ_IE-->
                        <field>
                            <name>IE_256HZ</name>
                            <description>IE_256HZ</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--1KHZ_IE-->
                        <field>
                            <name>IE_1KHZ</name>
                            <description>IE_1KHZ</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARM_IE-->
                        <field>
                            <name>ALARM_IE</name>
                            <description>ALARM_IE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ADJ_IE-->
                        <field>
                            <name>ADJ_IE</name>
                            <description>ADJ_IE</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_ISR: RTC IF-->
                <register>
                    <name>RTC_ISR</name>
                    <description>RTC IF</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAY_IF-->
                        <field>
                            <name>DAY_IF</name>
                            <description>DAY_IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HOUR_IF-->
                        <field>
                            <name>HOUR_IF</name>
                            <description>HOUR_IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MIN_IF-->
                        <field>
                            <name>MIN_IF</name>
                            <description>MIN_IF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SEC_IF-->
                        <field>
                            <name>SEC_IF</name>
                            <description>SEC_IF</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--2HZ_IF-->
                        <field>
                            <name>IF_2HZ</name>
                            <description>IF_2HZ</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--4HZ_IF-->
                        <field>
                            <name>IF_4HZ</name>
                            <description>IF_4HZ</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--8HZ_IF-->
                        <field>
                            <name>IF_8HZ</name>
                            <description>IF_8HZ</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--16HZ_IF-->
                        <field>
                            <name>IF_16HZ</name>
                            <description>IF_16HZ</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--64HZ_IF-->
                        <field>
                            <name>IF_64HZ</name>
                            <description>IF_64HZ</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--256HZ_IF-->
                        <field>
                            <name>IF_256HZ</name>
                            <description>IF_256HZ</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--1KHZ_IF-->
                        <field>
                            <name>IF_1KHZ</name>
                            <description>IF_1KHZ</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARM_IF-->
                        <field>
                            <name>ALARM_IF</name>
                            <description>ALARM_IF</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ADJ256_IF-->
                        <field>
                            <name>ADJ256_IF</name>
                            <description>ADJ256_IF</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDSEC: SECOND REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDSEC</name>
                    <description>SECOND REGISTER IN BCD</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SEC-->
                        <field>
                            <name>SEC</name>
                            <description>SECOND IN BCD</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDMIN: MINUTE REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDMIN</name>
                    <description>MINUTE REGISTER IN BCD</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--MIN-->
                        <field>
                            <name>MIN</name>
                            <description>MINUTE IN BCD</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDHOUR: HOUR REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDHOUR</name>
                    <description>HOUR REGISTER IN BCD</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--HOUR-->
                        <field>
                            <name>HOUR</name>
                            <description>HOUR IN BCD</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDDAY: DATE REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDDAY</name>
                    <description>DAY REGISTER IN BCD</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAY-->
                        <field>
                            <name>DAY</name>
                            <description>DAY IN BCD</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDWEEK: WEEK REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDWEEK</name>
                    <description>WEEK REGISTER IN BCD</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WEEK-->
                        <field>
                            <name>WEEK</name>
                            <description>WEEK IN BCD</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDMONTH: MONTH REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDMONTH</name>
                    <description>MONTH REGISTER IN BCD</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--MONTH-->
                        <field>
                            <name>MONTH</name>
                            <description>MONTH IN BCD</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_BCDYEAR: YEAR REGISTER IN BCD-->
                <register>
                    <name>RTC_BCDYEAR</name>
                    <description>YEAR REGISTER IN BCD</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--YEAR-->
                        <field>
                            <name>YEAR</name>
                            <description>YEAR IN BCD</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTC_ALARM: ALARM SETTING REGISTER -->
                <register>
                    <name>ALARM</name>
                    <description>ALARM SETTING REGISTER </description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ALARMSEC-->
                        <field>
                            <name>SEC</name>
                            <description>ALARM SECOND SETTING</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARMMIN-->
                        <field>
                            <name>MIN</name>
                            <description>ALARM MINUTE SETTING</description>
                            <bitRange>[14:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARMHOUR-->
                        <field>
                            <name>HOUR</name>
                            <description>ALARM HOUR SETTING</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
