zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--RTC_TMSEL: FREQ OUTPUT SELECT-->
                <register>
                    <name>RTC_TMSEL</name>
                    <description>FREQ SIGNAL OUTPUT SELECT</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TMSEL-->
                        <field>
                            <name>TMSEL</name>
                            <description>FREQ SIGNAL OUTPUT SELECT</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEC_CARRY</name>
                                    <description>SECOND CARRY SIGNAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIN_CARRY</name>
                                    <description>MINUTE CARRY SIGNAL</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HOUR_CARRY</name>
                                    <description>HOUR CARRY SIGNAL</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DATE_CARRY</name>
                                    <description>DATE CARRY SIGNAL</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ALARM_SIG</name>
                                    <description>ALARM SIGNAL</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32S_SIG</name>
                                    <description>32S_SIG</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_SEC_CARRY</name>
                                    <description>REVERSE SEC_CARRY</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_MIN_CARRY</name>
                                    <description>REVERSE MINUTE CARRY SIGNAL</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_HOUR_CARRY</name>
                                    <description>REVERSE HOUR CARRY SIGNAL</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_DATE_CARRY</name>
                                    <description>REVERSE DATE CARRY SIGNAL</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_ALARM</name>
                                    <description>REVERSE ALARM SIGNAL</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INNER_SEC</name>
                                    <description>INNER SECOND SIGNAL</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RTC_DJUST: LTBC ADJUST register -->
                <register>
                    <name>RTC_DJUST</name>
                    <description>LTBC ADJUST register </description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADJUST-->
                        <field>
                            <name>ADJUST</name>
                            <description>LTBC ADJUST</description>
                            <bitRange>[8:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
