zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--RTC_ADSIGN:  LTBC ADJUST SIGN REGISTER-->
                <register>
                    <name>RTC_ADSIGN</name>
                    <description>LTBC ADJUST SIGN REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADSIGN-->
                        <field>
                            <name>ADSIGN</name>
                            <description>LTBC ADJUST SIGN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADD</name>
                                    <description>ADD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>DECREASE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>            
                <!--RTC_SBSCNT: MS COUNTER register -->
                <register>
                    <name>RTC_SBSCNT</name>
                    <description>MS COUNTER register </description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--MSECCNT-->
                        <field>
                            <name>MSCNT</name>
                            <description>MS COUNTER</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR0-->
                <register>
                    <name>RTCBKR0</name>
                    <description>RTCBKR0</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR1-->
                <register>
                    <name>RTCBKR1</name>
                    <description>RTCBKR1</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR2-->
                <register>
                    <name>RTCBKR2</name>
                    <description>RTCBKR2</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR3-->
                <register>
                    <name>RTCBKR3</name>
                    <description>RTCBKR3</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR4-->
                <register>
                    <name>RTCBKR4</name>
                    <description>RTCBKR4</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR5-->
                <register>
                    <name>RTCBKR5</name>
                    <description>RTCBKR5</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR6-->
                <register>
                    <name>RTCBKR6</name>
                    <description>RTCBKR6</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCBKR7-->
                <register>
                    <name>RTCBKR7</name>
                    <description>RTCBKR7</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BKR0-->
                        <field>
                            <name>BKR0</name>
                            <description>BKR0</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
