zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
          <!--IWDT-->
        <peripheral>
            <name>IWDT</name>
            <description>IWDT</description>
            <groupName>IWDT</groupName>
            <baseAddress>0x40011400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--IWDT_SERV: IWDT SERVER-->
                <register>
                    <name>IWDT_SERV</name>
                    <description>IWDT SERVER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SERV-->
                        <field>
                            <name>SERV</name>
                            <description>wdtserv</description>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!--IWDT_CR: IWDT CONFIG REGISTER-->
                <register>
                    <name>IWDT_CR</name>
                    <description>IWDT CONFIG REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--CFG-->
                        <field>
                            <name>CFG</name>
                            <description>IWDT overflow period setting</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>125MS</name>
                                    <description>125MS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>250MS</name>
                                    <description>250MS</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>500MS</name>
                                    <description>500MS</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1S</name>
                                    <description>1S</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2S</name>
                                    <description>2S</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4S</name>
                                    <description>4S</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8S</name>
                                    <description>8S</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16S</name>
                                    <description>16S</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--IWDT_CNT: iwdt counter register-->
                <register>
                    <name>IWDT_CNT</name>
                    <description>iwdt counter register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CNT-->
                        <field>
                            <name>TCNT</name>
                            <description>IWDTCNT counter</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IWDT_WIN-->
                <register>
                    <name>IWDT_WIN</name>
                    <description>IWDTWIN</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WIN-->
                        <field>
                            <name>WIN</name>
                            <description>IWDTWIN</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IWDT_SR-->
                <register>
                    <name>IWDT_SR</name>
                    <description>IWDT_SR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>Iwdtbusy</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>no clear dog</name>
                                    <description>no clear dog</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clear dog</name>
                                    <description>clear dog</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
