zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
        <!--WWDT-->
        <peripheral>
            <name>WWDT</name>
            <description>WWDT Registers</description>
            <groupName>WWDT</groupName>
            <baseAddress>0x40011800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDT</name>
                <value>0</value>
            </interrupt>
            <registers>
                <!--WWDT_CR: WWDT CONTROL REGISTER-->
                <register>
                    <name>WWDT_CR</name>
                    <description>WWDT CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--WWDT_CFGR: WWDT CONFIG REGISTER-->
                <register>
                    <name>WWDT_CFGR</name>
                    <description>WWDT CONFIG REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WWDT_CFG-->
                        <field>
                            <name>WWDT_CFG</name>
                            <description>WWDT CONFIG</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1T</name>
                                    <description>TPCLK*4096*1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4T</name>
                                    <description>TPCLK*4096*4</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16T</name>
                                    <description>TPCLK*4096*16</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>64T</name>
                                    <description>TPCLK*4096*64</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>128T</name>
                                    <description>TPCLK*4096*128</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256T</name>
                                    <description>TPCLK*4096*256</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>512T</name>
                                    <description>TPCLK*4096*512</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1024T</name>
                                    <description>TPCLK*4096*1024</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--WWDT_CNT: WWDT COUNTER REGISTER-->
                <register>
                    <name>WWDT_CNT</name>
                    <description>WWDT COUNTER REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CNT-->
                        <field>
                            <name>CNT</name>
                            <description>WWDT COUNTER</description>
                            <bitRange>[9:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--WWDT_IER: WWDT IE-->
                <register>
                    <name>WWDT_IER</name>
                    <description>WWDT IE</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IE-->
                        <field>
                            <name>IE</name>
                            <description>WWDT IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--WWDT_ISR: WWDT IF-->
                <register>
                    <name>WWDT_ISR</name>
                    <description>WWDT IF</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IF-->
                        <field>
                            <name>if</name>
                            <description>WWDT IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--WWDT_PSC: WWDT COUNTER REGISTER-->
                <register>
                    <name>WWDT_PSC</name>
                    <description>WWDTDIV</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DIV_CNT-->
                        <field>
                            <name>DIV_CNT</name>
                            <description>div_cnt</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
