zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
<!--U7816-->
        <peripheral>
            <name>U7816</name>
            <description>U7816 Registers</description>
            <groupName>U7816</groupName>
            <baseAddress>0x40011C00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x02C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>U7816</name>
                <value>15</value>
            </interrupt>
            <registers>
                <!--U7816_CR: U7816 CONTROL REGISTER-->
                <register>
                    <name>U7816_CR</name>
                    <description>U7816 CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--HPUEN-->
                        <field>
                            <name>HPUEN</name>
                            <description>PULLUP ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>PULLUP DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>PULLUP ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--HPUAT-->
                        <field>
                            <name>HPUAT</name>
                            <description>AUTO PULLUP ENABLE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>AUTO PULLUP DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>AUTO PULLUP ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CKOEN-->
                        <field>
                            <name>CKOEN</name>
                            <description>CLK OUTPUT ENABLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CKO_DIS</name>
                                    <description>CLK OUPUT DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CKO_EN</name>
                                    <description>CLK OUTPUT ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXEN-->
                        <field>
                            <name>RXEN</name>
                            <description>RX ENABLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RX_DIS</name>
                                    <description>RX DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RX_EN</name>
                                    <description>RX ENABLE </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXEN-->
                        <field>
                            <name>TXEN</name>
                            <description>TX ENABLE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TX_DIS</name>
                                    <description>TX DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TX_EN</name>
                                    <description>TX ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--U7816_FFR: U7816 FRAME CONTROL-->
                <register>
                    <name>U7816_FFR</name>
                    <description>U7816 FRAME CONTROL</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000006</resetValue>
                    <fields>
                        <!--DICONV-->
                        <field>
                            <name>DICONV</name>
                            <description>DIRECTION CONV</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSB</name>
                                    <description>LSB FIRST</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MSB</name>
                                    <description>MSB FIRST</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RREPEN-->
                        <field>
                            <name>RREPEN</name>
                            <description>AUTO POSTBACK ERROR SIGNAL WHEN PARITY_ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TREPEN-->
                        <field>
                            <name>TREPEN</name>
                            <description>AUTO POSTBACK WHEN RECEIVED ERROR SIGNAL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RFREN-->
                        <field>
                            <name>RFREN</name>
                            <description>Guard Time Length</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2ETU</name>
                                    <description>2ETU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1ETU</name>
                                    <description>1ETU</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PAR-->
                        <field>
                            <name>PAR</name>
                            <description>PARITY MODE</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Even</name>
                                    <description>Even</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Odd</name>
                                    <description>Odd</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Always1</name>
                                    <description>Always 1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOT_HANDLE</name>
                                    <description>NOT_HANDLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--REP_T-->
                        <field>
                            <name>REP_T</name>
                            <description>REPEAT TIME</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1T</name>
                                    <description>1T</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3T</name>
                                    <description>3T</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BGTEN-->
                        <field>
                            <name>BGTEN</name>
                            <description>block guard time enable</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BGT_DIS</name>
                                    <description>BGT DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BGT_EN</name>
                                    <description>BGT_EN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ERSGD-->
                        <field>
                            <name>ERSGD</name>
                            <description>GUARDTIME LENGTH AFTER ERROR SIGNAL</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2.5ETU</name>
                                    <description>2~2.5ETU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.5ETU</name>
                                    <description>1~1.5ETU</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ERSW-->
                        <field>
                            <name>ERSW</name>
                            <description>ERROR SIGNAL LENGTH</description>
                            <bitRange>[10:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2ETU</name>
                                    <description>2ETU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2ETU</name>
                                    <description>2ETU</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.5ETU</name>
                                    <description>1.5ETU</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1ETU</name>
                                    <description>1ETU</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SFREN-->
                        <field>
                            <name>SFREN</name>
                            <description>SFREN</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2 etu</name>
                                    <description>2 etu</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3 etu</name>
                                    <description>3 etu</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--U7816_EGTR: U7816 EGT config-->
                <register>
                    <name>U7816EGT</name>
                    <description>U7816 EGT config</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXEGT-->
                        <field>
                            <name>TXEGT</name>
                            <description>TX EGT</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816_PSC: U7816 CLK DIVIDED CONFIG-->
                <register>
                    <name>U7816CLKDIV</name>
                    <description>U7816 CLK DIVIDED CONFIG</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <!--CLKDIV-->
                        <field>
                            <name>CLKDIV</name>
                            <description>CLK DIVIDED F7816=FAPBCLK/(CLKDIV+1)</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816_BGR: U7816 FREQ DIVISION CONFIG-->
                <register>
                    <name>U7816_BGR</name>
                    <description>U7816 FREQ DIVISION CONFIG</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000173</resetValue>
                    <fields>
                        <!--PDIV-->
                        <field>
                            <name>PDIV</name>
                            <description>Baud = F7816/(PDIV+1)</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
