zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--U7816_RXBUF: U7816 RX BUF-->
                <register>
                    <name>U7816_RXBUF</name>
                    <description>U7816 RX BUF</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXBUF-->
                        <field>
                            <name>RXBUF</name>
                            <description>RX BUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816_TXBUF: U7816 TX BUF -->
                <register>
                    <name>U7816_TXBUF</name>
                    <description>U7816 TX BUF</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXBUF-->
                        <field>
                            <name>TXBUF</name>
                            <description>TX BUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816_IER: U7816 IE-->
                <register>
                    <name>U7816IE</name>
                    <description>U7816 IE</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LSIE-->
                        <field>
                            <name>LSIE</name>
                            <description>FOR ERROR_FLAG</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>TX IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>RX IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816_ISR: U7816 IF-->
                <register>
                    <name>U7816_ISR</name>
                    <description>U7816 IF</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ERRIF-->
                        <field>
                            <name>ERRIF</name>
                            <description>ERR IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF-->
                        <field>
                            <name>TXIF</name>
                            <description>TX IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF-->
                        <field>
                            <name>RXIF</name>
                            <description>RX IF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVERR-->
                        <field>
                            <name>OVERR</name>
                            <description>OVerflow ERROR</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--FRERR-->
                        <field>
                            <name>FRERR</name>
                            <description>FRAME ERROR</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RPARERR-->
                        <field>
                            <name>TPARERR</name>
                            <description>TX PARITY ERROR</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TPARERR-->
                        <field>
                            <name>TPARERR</name>
                            <description>TX PARITY ERROR</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXBUSY-->
                        <field>
                            <name>RXBUSY</name>
                            <description>RX BUSY</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXBUSY-->
                        <field>
                            <name>TXBUSY</name>
                            <description>TX BUSY</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WAIT_RPT-->
                        <field>
                            <name>WAIT_RPT</name>
                            <description>WAIT_RPT</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
