zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>     
         <!--UART COMMON-->
        <peripheral>
            <name>UART_COMMON</name>
            <description>UART_COMMON Registers</description>
            <groupName>UART</groupName>
            <baseAddress>0x40012008</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x004</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--UART_IRCR: IR CONFIG-->
                <register>
                    <name>UART_IRCR</name>
                    <description>IR CONFIG</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000D0</resetValue>
                    <fields>
                        <!--TZBRG-->
                        <field>
                            <name>TZBRG</name>
                            <description>FIR = Fpclk / (TZBRG +1) </description>
                            <bitRange>[10:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TH-->
                        <field>
                            <name>TH</name>
                            <description>duty cuycle Y = (TZBRG[10:4] * TH) /(TZBRG+1)</description>
                            <bitRange>[14:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IRFLAG-->
                        <field>
                            <name>IRFLAG</name>
                            <description>IRFLAG</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--UART0-->
        <peripheral>
            <name>UART0</name>
            <description>UART0 Registers</description>
            <groupName>UART</groupName>
            <baseAddress>0x4001200C</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART0</name>
                <value>10</value>
            </interrupt>
            <registers>
                <!--UART0_CSR:UARTx Config-->
                <register>
                    <name>UART_CSR</name>
                    <description>UART Config</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <!--TXEN-->
                        <field>
                            <name>TXEN</name>
                            <description>TX ENable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXEN-->
                        <field>
                            <name>RXEN</name>
                            <description>RX ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXPOL-->
                        <field>
                            <name>TXPOL</name>
                            <description>UARTx TXPOL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>UARx TX NORMAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REVERSE</name>
                                    <description>UARx TX REVERSE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXPOL-->
                        <field>
                            <name>RXPOL</name>
                            <description>UARTx RXPOL</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>UARx RX NORMAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REVERSE</name>
                                    <description>UARx RX REVERSE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PARITY-->
                        <field>
                            <name>PARITY</name>
                            <description>UARTx PARITY</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO PARITY</name>
                                    <description>UARx NO PARITY BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PARITY EVEN</name>
                                    <description>UARx PARITY EVEN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PARITY ODD</name>
                                    <description>UARx PARITY ODD</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PDSEL-->
                        <field>
                            <name>PDSEL</name>
                            <description>UARTx PDSEL</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>7 BIT</name>
                                    <description>UARx 7 BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8 BIT</name>
                                    <description>UARx 8 BIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>9 BIT</name>
                                    <description>UARx 9 BIT</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--STOPSEL-->
                        <field>
                            <name>STOPSEL</name>
                            <description>STOP BIT select</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1BIT</name>
                                    <description>1 STOPBIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2BIT</name>
                                    <description>2 STOPBIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BITORD-->
                        <field>
                            <name>BITORD</name>
                            <description>UARTx BITORD</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1BIT</name>
                                    <description>1 STOPBIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2BIT</name>
                                    <description>2 STOPBIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMATXIFCFG-->
                        <field>
                            <name>DMATXIFCFG</name>
                            <description>UARTx DMATXIFCFG</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DEPENDS</name>
                                    <description>DEPENDS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--NEWUP-->
                        <field>
                            <name>NEWUP</name>
                            <description>UARTx Negedge Wakeup</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXTOEN-->
                        <field>
                            <name>RXTOEN</name>
                            <description>UARTx RXTOEN</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXIREN-->
                        <field>
                            <name>TXIREN</name>
                            <description>UARTx TXIREN</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>UARTx BUSY</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO BUSY</name>
                                    <description>NO BUSY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUSY</name>
                                    <description>BUSY</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--UART0_IER :UARTx IE Config-->
                <register>
                    <name>UART_IER</name>
                    <description>UART IE Config</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXSE_IE-->
                        <field>
                            <name>TXSE_IE</name>
                            <description>UARTx TXSE_IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXBE_IE-->
                        <field>
                            <name>TXBE_IE</name>
                            <description>UARTx TXBE_IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--NEWUP_IE-->
                        <field>
                            <name>NEWUP_IE</name>
                            <description>UARTx NEWUP_IE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXBF_IE-->
                        <field>
                            <name>RXBF_IE</name>
                            <description>UART RXBF_IE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXERR_IE-->
                        <field>
                            <name>RXERR_IE</name>
                            <description>UARTx RXERR_IE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXTO_IE-->
                        <field>
                            <name>RXTO_IE</name>
                            <description>UARTx RXTO_IE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
