zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--I2C_MSP_SR-->
                <register>
                    <name>I2C_MSP_SR</name>
                    <description>I2C_MSP_SR</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ACKMO-->
                        <field>
                            <name>ACKMO</name>
                            <description>Ack Master output</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MRP0</name>
                                    <description>MASTER RESPOND 0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MRPN</name>
                                    <description>MASTER RESPOND NONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                    
                        <!--BF-->
                        <field>
                            <name>BF</name>
                            <description>BUFF FULL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>SSPBUF EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL</name>
                                    <description>SSPBUF FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RW-->
                        <field>
                            <name>RW</name>
                            <description>RW</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--I2C_MSP_BRG-->
                <register>
                    <name>I2C_MSP_BRG</name>
                    <description>MSP_BRG</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00130013</resetValue>
                    <fields>
                        <!--MSPBRGL-->
                        <field>
                            <name>MSPBRGL</name>
                            <description>MSPBRGL</description>
                            <bitRange>[8:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MSPBRGH-->
                        <field>
                            <name>MSPBRGH</name>
                            <description>MSPBRGH</description>
                            <bitRange>[24:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2C_MSP_BUF-->
                <register>
                    <name>I2CBUF</name>
                    <description>I2C BUF</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--MSPBUF-->
                        <field>
                            <name>MSPBUF</name>
                            <description>I2C BUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2C_MSP_TCR-->
                <register>
                    <name>MSP_TIMING</name>
                    <description>MSP_TIMING</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000A</resetValue>
                    <fields>
                        <!--SDAHD-->
                        <field>
                            <name>SDAHD</name>
                            <description>SDA HOLD TIME</description>
                            <bitRange>[8:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2C_MSP_TOR-->
                <register>
                    <name>TIMEOUT</name>
                    <description>TIMEOUT</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <!--TIMEOUT-->
                        <field>
                            <name>TIMEOUT</name>
                            <description>TIMEOUT</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                 <!--I2C_SSP_CR-->
                <register>
                    <name>I2C_SSP_CR</name>
                    <description>I2C_SSP_CR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000210</resetValue>
                    <fields>
                        <!--SSPEN-->
                        <field>
                            <name>SSPEN</name>
                            <description>SSPEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                             <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--A10EN-->
                        <field>
                            <name>A10EN</name>
                            <description>A10EN</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--SCLI_ANFEN-->
                        <field>
                            <name>SCLI_ANFEN</name>
                            <description>SCLI_ANFEN</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--SDAO_DLYEN-->
                        <field>
                            <name>SCLI_ANFEN</name>
                            <description>SCLI_ANFEN</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--ACKEN-->
                        <field>
                            <name>ACKEN</name>
                            <description>SCLI_ANFEN</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--SSP_DMAEN-->
                        <field>
                            <name>SSP_DMAEN</name>
                            <description>SSP_DMAEN</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--SCLSEN-->
                        <field>
                            <name>SCLSEN</name>
                            <description>SCLSEN</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>                             
                        </field>
                    </fields>
                </register>
