zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--I2C_SSP_IER-->
                <register>
                    <name>I2C_SSP_IER</name>
                    <description>I2C_SSP_IER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>RXIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>                            
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>TXIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--ADME-->
                        <field>
                            <name>ADME</name>
                            <description>ADME</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--SSPOVE-->
                        <field>
                            <name>SSPOVE</name>
                            <description>SSPOVE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--WCOLE-->
                        <field>
                            <name>WCOLE</name>
                            <description>WCOLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--PE-->
                        <field>
                            <name>PE</name>
                            <description>PE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--SE-->
                        <field>
                            <name>SE</name>
                            <description>SE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--ADEE-->
                        <field>
                            <name>ADEE</name>
                            <description>SE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>                             
                        </field>
                    </fields>
                </register>
                <!--I2C_SSP_ISR-->
                <register>
                    <name>I2C_SSP_ISR</name>
                    <description>I2C_SSP_ISR</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIF-->
                        <field>
                            <name>RXIF</name>
                            <description>RXIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>                            
                        </field>
                        <!--TXIF-->
                        <field>
                            <name>TXIF</name>
                            <description>TXIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--ADM-->
                        <field>
                            <name>ADM</name>
                            <description>ADM</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--SSPOV-->
                        <field>
                            <name>SSPOV</name>
                            <description>SSPOV</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>                             
                        </field>
                        <!--WCOL-->
                        <field>
                            <name>WCOL</name>
                            <description>WCOLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>                             
                        </field>
                         <!--P-->
                        <field>
                            <name>P</name>
                            <description>P</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>                             
                        </field>
                         <!--S-->
                        <field>
                            <name>S</name>
                            <description>S</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>                             
                        </field>
                        <!--ADEE-->
                        <field>
                            <name>ADEE</name>
                            <description>SE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>                             
                        </field>
                    </fields>
                </register>
                <!--I2C_SSP_SR-->
                <register>
                    <name>I2C_SSP_SR</name>
                    <description>I2C_SSP_ISR</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BF-->
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>                            
                        </field>
                        <!--DA-->
                        <field>
                            <name>DA</name>
                            <description>DA</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>                             
                        </field>
                        <!--RW-->
                        <field>
                            <name>RW</name>
                            <description>RW</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>                             
                        </field>
                         <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>                             
                        </field>                     
                    </fields>
                </register>
                <!--I2C_SSP_BUF-->
                <register>
                    <name>I2C_SSP_SR</name>
                    <description>I2C_SSP_ISR</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SSPBUF-->
                        <field>
                            <name>SSPBUF</name>
                            <description>SSPBUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>                            
                        </field>                      
                    </fields>
                </register>
                <!--I2C_SSP_ADR-->
                <register>
                    <name>I2C_SSP_ADR</name>
                    <description>I2C_SSP_ADR</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SSPBUF-->
                        <field>
                            <name>SSPBUF</name>
                            <description>SSPBUF</description>
                            <bitRange>[9:0]</bitRange>
                            <access>read-write</access>                            
                        </field>                      
                    </fields>
                </register>
