zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>  
          <!--RCC_PDR-->
        <peripheral>
            <name>RCC_PDR</name>
            <description>RCC_PDR Registers</description>
            <groupName>RCC</groupName>
            <baseAddress>0x40012800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x04</size>
                <usage>registers</usage>
            </addressBlock>           
            <registers>
                <!--PDR_CR: PDR CONFIG-->
                <register>
                    <name>PDR_CR</name>
                    <description>PDR CONFIG REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>PDR ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CFG-->
                        <field>
                            <name>CFG</name>
                            <description>PDR CONFIG</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1.5V</name>
                                    <description>1.5V</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.25V</name>
                                    <description>1.25V</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.35V</name>
                                    <description>1.35V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.4V</name>
                                    <description>1.4V</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
               </registers>
        </peripheral>   
         <!--RCC_BOR-->
        <peripheral>
            <name>RCC_BOR</name>
            <description>RCC_BOR Registers</description>
            <groupName>RCC</groupName>
            <baseAddress>0x40012804</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x04</size>
                <usage>registers</usage>
            </addressBlock>           
            <registers>
                <!--BOR_CR: BOR CONFIG-->
                <register>
                    <name>BOR_CR</name>
                    <description>BOR CONFIG REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--OFF_BOR-->
                        <field>
                            <name>OFF_BOR</name>
                            <description>BOR OFF ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CFG-->
                        <field>
                            <name>CFG</name>
                            <description>BOR CONFIG</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1.7V</name>
                                    <description>1.7V</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.6V</name>
                                    <description>1.6V</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.65V</name>
                                    <description>1.65V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.75V</name>
                                    <description>1.75V</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
               </registers>
        </peripheral>   
         <!--SVD-->
        <peripheral>
            <name>SVD</name>
            <description>SVD Registers</description>
            <groupName>SVD</groupName>
            <baseAddress>0x40012824</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x14</size>
                <usage>registers</usage>
            </addressBlock>  
             <interrupt>
                <name>SVD</name>
                <value>1</value>
            </interrupt>         
            <registers>                   
                <!--SVD_CFGR: SVD CONFIG REGISTER-->
                <register>
                    <name>SVD_CFGR</name>
                    <description>SVD CONFIG REGISTER</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000008</resetValue>
                    <fields>
                        <!--ITVL-->
                        <field>
                            <name>ITVL</name>
                            <description>SVD Interval</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>62.5ms</name>
                                    <description>62.5ms</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256ms</name>
                                    <description>256ms</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1s</name>
                                    <description>1s</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4s</name>
                                    <description>4s</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MOD-->
                        <field>
                            <name>MOD</name>
                            <description>MODE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMTEN</name>
                                    <description>INTERMITTENT ENABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OFTEN</name>
                                    <description>OFTEN ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DFEN-->
                        <field>
                            <name>DFEN</name>
                            <description>SVD DIGITAL FILTER ENABLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--LVL-->
                        <field>
                            <name>LVL</name>
                            <description>SVD ALARM LEVEL</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
