zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--SVD_CR: SVD CONTROL REGISTER-->
                <register>
                    <name>SVD_CR</name>
                    <description>SVD CONTROL REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>SVD ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SVSEN-->
                        <field>
                            <name>SVSEN</name>
                            <description>SVS ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TE-->
                        <field>
                            <name>TE</name>
                            <description>SVD TEST EENABLE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SVD_IER-->
                <register>
                    <name>SVD_IER</name>
                    <description>SVD_IER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRIE-->
                        <field>
                            <name>PRIE</name>
                            <description>PRIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PFIE-->
                        <field>
                            <name>PFIE</name>
                            <description>PFIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SVD_ISR: SVD STATUS AND IF-->
                <register>
                    <name>SVD_ISR</name>
                    <description>SVD STATUS AND IF</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRF-->
                        <field>
                            <name>PRF</name>
                            <description>PRF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PFF-->
                        <field>
                            <name>PFF</name>
                            <description>PFF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SVDR-->
                        <field>
                            <name>SVDR</name>
                            <description>SVD OUTPUT LATCH</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--SVDO-->
                        <field>
                            <name>SVDO</name>
                            <description>SVD OUTPUT</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--SVD_VSR-->
                <register>
                    <name>SVD_VSR</name>
                    <description>SVD_VSR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000004</resetValue>
                    <fields>
                        <!--V0P75EN-->
                        <field>
                            <name>V0P75EN</name>
                            <description>V0P75EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--V0P8EN-->
                        <field>
                            <name>V0P8EN</name>
                            <description>V0P8EN</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--V0P85EN-->
                        <field>
                            <name>V0P85EN</name>
                            <description>V0P85EN</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
