zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--OPA1_IER-->
                <register>
                    <name>OPA1_IER</name>
                    <description>COMP IE REGISTER</description>
                    <addressOffset>08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RIE-->
                        <field>
                            <name>RIE</name>
                            <description>COMP1RIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FIE-->
                        <field>
                            <name>FIE</name>
                            <description>COMP1FIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--OPA1_ISR: COMP IF REGISTER-->
                <register>
                    <name>OPA1_ISR</name>
                    <description>COMP IF REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RIF-->
                        <field>
                            <name>RIF</name>
                            <description>COMP1RIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>RESET</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FIF-->
                        <field>
                            <name>FIF</name>
                            <description>COMP1FIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OUT-->
                        <field>
                            <name>OUT</name>
                            <description>COMP1O</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                  </registers>
        </peripheral>   
         <!--OPA2-->
        <peripheral>
            <name>OPA2</name>
            <description>OPA Registers</description>
            <groupName>OPA</groupName>
            <baseAddress>0x40012854</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x10</size>
                <usage>registers</usage>
            </addressBlock> 
             <registers>           
                <!--OPA2_CR: COMP1 CONTROL REGISTER-->
                <register>
                    <name>OPA2_CR</name>
                    <description>COMP2 CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPM-->
                        <field>
                            <name>LPM</name>
                            <description>OPA2LPM</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL MODE</name>
                                    <description>NORMAL MODE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW POWER MODE</name>
                                    <description>LOW POWER MODE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MOD-->
                        <field>
                            <name>MOD</name>
                            <description>OPA2MOD</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>standalone MODE</name>
                                    <description>standalone MODE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMP MODE</name>
                                    <description>COMP MODE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PGA MODE</name>
                                    <description>PGA MODE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>buffer MODE</name>
                                    <description>buffer MODE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PGA_GAIN-->
                        <field>
                            <name>PGA_GAIN</name>
                            <description>PGA_GAIN</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PGA*2</name>
                                    <description>PGA*2</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PGA*4</name>
                                    <description>PGA*4</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PGA*8</name>
                                    <description>PGA*8</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PGA*16</name>
                                    <description>PGA*16</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VN_EXC-->
                        <field>
                            <name>VN_EXC</name>
                            <description>VN_EXC</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT CONNECT GPIO</name>
                                    <description>NOT CONNECT GPIO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CONNECT GPIO</name>
                                    <description>CONNECT GPIO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DF-->
                        <field>
                            <name>DF</name>
                            <description>COMP2DF</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VPSEL-->
                        <field>
                            <name>VPSEL</name>
                            <description>VPSEL</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OPA1_INP1</name>
                                    <description>OPA1_INP1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OPA1_INP2</name>
                                    <description>OPA1_INP2</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VNSEL-->
                        <field>
                            <name>VNSEL</name>
                            <description>VNSEL</description>
                            <bitRange>[11:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OPA1_INN1</name>
                                    <description>OPA1_INN1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OPA1_INN2</name>
                                    <description>OPA1_INN2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>VREF</name>
                                    <description>VREF</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3/4 VREF</name>
                                    <description>3/4 VREF</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1/2 VREF</name>
                                    <description>1/2 VREF</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1/4 VREF</name>
                                    <description>1/4 VREF</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1/8 VREF</name>
                                    <description>1/8 VREF</description>
                                    <value>6</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>                                             
                    </fields>
                </register>
                <!--OPA2_CALR-->
                <register>
                    <name>OPA2_CALR</name>
                    <description>OPA2_CALR</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PCAL-->
                        <field>
                            <name>PCAL</name>
                            <description>PCAL</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT CHANGE</name>
                                    <description>NOT CHANGE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECREASE_MIN</name>
                                    <description>DECREASE_MIN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECREASE_MAX</name>
                                    <description>DECREASE_MAX</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOT CHANGE</name>
                                    <description>NOT CHANGE</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADD_MIN</name>
                                    <description>ADD_MIN</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADD_MAX</name>
                                    <description>ADD_MAX</description>
                                    <value>31</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PCAL_EN-->
                        <field>
                            <name>PCAL_EN</name>
                            <description>PCAL_EN</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--NCAL-->
                        <field>
                            <name>NCAL</name>
                            <description>NCAL</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT CHANGE</name>
                                    <description>NOT CHANGE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECREASE_MIN</name>
                                    <description>DECREASE_MIN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECREASE_MAX</name>
                                    <description>DECREASE_MAX</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOT CHANGE</name>
                                    <description>NOT CHANGE</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADD_MIN</name>
                                    <description>ADD_MIN</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADD_MAX</name>
                                    <description>ADD_MAX</description>
                                    <value>31</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>NCAL_EN</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
