zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--OPA2_IER-->
                <register>
                    <name>OPA2_IER</name>
                    <description>COMP IE REGISTER</description>
                    <addressOffset>08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RIE-->
                        <field>
                            <name>RIE</name>
                            <description>COMP2RIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FIE-->
                        <field>
                            <name>FIE</name>
                            <description>COMP2FIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--OPA2_ISR: COMP IF REGISTER-->
                <register>
                    <name>OPA2_ISR</name>
                    <description>COMP IF REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RIF-->
                        <field>
                            <name>RIF</name>
                            <description>COMP2RIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>RESET</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FIF-->
                        <field>
                            <name>FIF</name>
                            <description>COMP2FIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OUT-->
                        <field>
                            <name>OUT</name>
                            <description>COMP1O</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                  </registers>
        </peripheral>     
          <!--LPTIM-->
        <peripheral>
            <name>LPTIM</name>
            <description>LPTIM Registers</description>
            <groupName>LPTIM</groupName>
            <baseAddress>0x40013400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPTIM</name>
                <value>20</value>
            </interrupt>
            <registers>
                <!--LPT_CFGR: LPTIMER CONFIG REGISTER-->
                <register>
                    <name>LPTIM_CFGR</name>
                    <description>LPTIMER CONFIG REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TMODE-->
                        <field>
                            <name>TMODE</name>
                            <description>TMODE</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OUT_CNT</name>
                                    <description>OUT_CNT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRIG_CNT</name>
                                    <description>TRIG_CNT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTER_SOURCE</name>
                                    <description>OUTER_SOURCE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Timeout</name>
                                    <description>Timeout</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ONST-->
                        <field>
                            <name>ONST</name>
                            <description>ONST</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CONTINUOUS</name>
                                    <description>CONTINUOUS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONCE</name>
                                    <description>ONCE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TRIGCFG-->
                        <field>
                            <name>TRIGCFG</name>
                            <description>TRIGCFG</description>
                            <bitRange>[6:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BOTH</name>
                                    <description>BOTH</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BOTH</name>
                                    <description>BOTH</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EDGESEL-->
                        <field>
                            <name>EDGESEL</name>
                            <description>EDGE SELECT</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DIVSEL-->
                        <field>
                            <name>DIVSEL</name>
                            <description>CLK DIVIDED SELECT</description>
                            <bitRange>[12:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIV1</name>
                                    <description>DIV1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>DIV2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>DIV4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>DIV8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>DIV16</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV32</name>
                                    <description>DIV32</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV64</name>
                                    <description>DIV64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV128</name>
                                    <description>DIV128</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--INSEL-->
                        <field>
                            <name>INSEL</name>
                            <description>LPTIM SELECT</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PIN INPUT</name>
                                    <description>PIN INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADC_EOC</name>
                                    <description>ADC_EOC</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PSCSEL-->
                        <field>
                            <name>PSCSEL</name>
                            <description>PSCSEL</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL</name>
                                    <description>CLKSEL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPTINSEL</name>
                                    <description>LPTINSEL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ETR_AFEN-->
                        <field>
                            <name>ETR_AFEN</name>
                            <description>ETR_AFEN</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LPT_CNT: LPTIMER COUNTER REGISTER-->
                <register>
                    <name>LPTIM_CNT</name>
                    <description>LPTIMER COUNTER REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CNT32-->
                        <field>
                            <name>CNT32</name>
                            <description>CNT32</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
