zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--LPT_CR1-->
                <register>
                    <name>LPTIM_CCR1</name>
                    <description>LPT_CCR1</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCR1-->
                        <field>
                            <name>CCR1</name>
                            <description>CCR1</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPT_CCR2-->
                <register>
                    <name>LPTIM_CCR2</name>
                    <description>LPT_CCR2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCR2-->
                        <field>
                            <name>CCR2</name>
                            <description>CCR2</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>   
           <!--AES-->
        <peripheral>
            <name>AES</name>
            <description>AES Registers</description>
            <groupName>AES</groupName>
            <baseAddress>0x40013800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x080</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>AES</name>
                <value>19</value>
            </interrupt>
            <registers>
                <!--AESCR: AES CONTROL REGISTER-->
                <register>
                    <name>AES_CR</name>
                    <description>AES CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DATATYP-->
                        <field>
                            <name>DATATYP</name>
                            <description>DATATYP</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>32bit</name>
                                    <description>32bit</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16bit</name>
                                    <description>16bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8bit</name>
                                    <description>8bit</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1bit</name>
                                    <description>1bit</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MODE-->
                        <field>
                            <name>MODE</name>
                            <description>MODE</description>
                            <bitRange>[4:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENCRYPT</name>
                                    <description>ENCRYPT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>KEY_EXPANSION</name>
                                    <description>KEY_EXPANSION</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECRYPT</name>
                                    <description>DECRYPT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>KEYEXP_DEC</name>
                                    <description>KEY_EXPANSION + DECRYPT</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHMOD-->
                        <field>
                            <name>CHMOD</name>
                            <description>CHMOD</description>
                            <bitRange>[6:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ECB</name>
                                    <description>ECB</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CBC</name>
                                    <description>CBC</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTR</name>
                                    <description>CTR</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MultH</name>
                                    <description>MultH</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMAIEN-->
                        <field>
                            <name>DMAIEN</name>
                            <description>DMAIEN</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DMAOEN-->
                        <field>
                            <name>DMAOEN</name>
                            <description>DMAOEN</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--KEYLEN-->
                        <field>
                            <name>KEYLEN</name>
                            <description>KEYLEN</description>
                            <bitRange>[14:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>128bit</name>
                                    <description>128bit</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>192bit</name>
                                    <description>192bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256bit</name>
                                    <description>256bit</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV</name>
                                    <description>REV</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--AES_IER: AES IE REGISTER-->
                <register>
                    <name>AES_IER</name>
                    <description>AES IE REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCF_IE-->
                        <field>
                            <name>CCF_IE</name>
                            <description>CCF_IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RDERR_IE-->
                        <field>
                            <name>RDERR_IE</name>
                            <description>RDERR_IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WRERR_IE-->
                        <field>
                            <name>WRERR_IE</name>
                            <description>WRERR_IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
