zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--AES_KEY2: AES KEY2 REGISTER-->
                <register>
                    <name>AES_KEY2</name>
                    <description>AES KEY2 REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--KEY2-->
                        <field>
                            <name>KEY2</name>
                            <description>KEY2</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_KEY3: AES KEY3 REGISTER-->
                <register>
                    <name>AES_KEY3</name>
                    <description>AES KEY3 REGISTER</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--KEY3-->
                        <field>
                            <name>KEY3</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_KEY4: AES KEY4 REGISTER-->
                <register>
                    <name>AES_KEY4</name>
                    <description>AES KEY4 REGISTER</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--KEY4-->
                        <field>
                            <name>KEY4</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_KEY5: AES KEY5 REGISTER-->
                <register>
                    <name>AES_KEY5</name>
                    <description>AES KEY5 REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--KEY5-->
                        <field>
                            <name>KEY5</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_KEY6: AES KEY6 REGISTER-->
                <register>
                    <name>AES_KEY6</name>
                    <description>AES KEY6 REGISTER</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--KEY6-->
                        <field>
                            <name>KEY6</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_KEY7: AES KEY7 REGISTER-->
                <register>
                    <name>AES_KEY7</name>
                    <description>AES KEY7 REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--KEY7-->
                        <field>
                            <name>KEY7</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_IVR0: AES INITIAL VECTOR0 REGISTER-->
                <register>
                    <name>AES_IVR0</name>
                    <description>AES INITIAL VECTOR0 REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IVR0-->
                        <field>
                            <name>IVR0</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_IVR1: AES INITIAL VECTOR1 REGISTER-->
                <register>
                    <name>AES_IVR1</name>
                    <description>AES INITIAL VECTOR1 REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IVR1-->
                        <field>
                            <name>IVR1</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_IVR2: AES INITIAL VECTOR2 REGISTER-->
                <register>
                    <name>AES_IVR2</name>
                    <description>AES INITIAL VECTOR2 REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IVR2-->
                        <field>
                            <name>IVR2</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AES_IVR3: AES INITIAL VECTOR3 REGISTER-->
                <register>
                    <name>AES_IVR3</name>
                    <description>AES INITIAL VECTOR3 REGISTER</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IVR3-->
                        <field>
                            <name>IVR3</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
