zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
          <!--RNG_CR-->
        <peripheral>
            <name>RNG_CR</name>
            <description>RNG_CR Registers</description>
            <groupName>RNG_CR</groupName>
            <baseAddress>0x40012864</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>           
            <registers> 
             <!--RNG_CR_CR: RNG CONFIG REGISTER-->
                <register>
                    <name>RNG_CR</name>
                    <description>RNG CONFIG REGISTER</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EN-->
                        <field>
                            <name>EN</name>
                            <description>RNG enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                           <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>>
                        </field> 
                        </fields>
                         </register>
                          </registers>
        </peripheral>                   
          <!--RNG-->
        <peripheral>
            <name>RNG</name>
            <description>TRNG Registers</description>
            <groupName>TRNG</groupName>
            <baseAddress>0x40013C04</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TRNG</name>
                <value>22</value>
            </interrupt>
            <registers>
                <!--RNG_DOR: RNG OUTPUT REGISTER-->
                <register>
                    <name>RNG_DOR</name>
                    <description>RNG OUTPUT REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OUT-->
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RNG_SR: TRNG IF REGISTER -->
                <register>
                    <name>RNG_SR</name>
                    <description>RNG IF REGISTER </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RNF-->
                        <field>
                            <name>RNF</name>
                            <description>RNF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>RESET</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LFSREN-->
                        <field>
                            <name>LFSREN</name>
                            <description>LFSREN</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>RESET</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RNG_CRC_CR-->
                <register>
                    <name>RNG_CRC_CR</name>
                    <description>RNG_CRC_CR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCEN-->
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RNG_CRC_DIR-->
                <register>
                    <name>RNG_CRC_DIR</name>
                    <description>RNG_CRC_DIR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <!--CRCIN-->
                        <field>
                            <name>CRCIN</name>
                            <description>CRCIN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RNG_CRC_SR-->
                <register>
                    <name>RNG_CRC_SR</name>
                    <description>RNG_CRC_SR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCDONE-->
                        <field>
                            <name>CRCDONE</name>
                            <description>CRCDONE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>RESET</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
