zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--ATIM_CR2-->
                <register>
                    <name>ATIM_CR2</name>
                    <description>ATIMER CONTROL REGISTER 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCPC-->
                        <field>
                            <name>CCPC</name>
                            <description>capture/compare preload control</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CCUS-->
                        <field>
                            <name>CCUS</name>
                            <description>capture/compare update select</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>COMG UPDATE</name>
                                    <description>COMG UPDATE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMG UPDATE OR TRGI RISING</name>
                                    <description>COMG UPDATE OR TRGI RISING</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CCDS-->
                        <field>
                            <name>CCDS</name>
                            <description>capture/compare dma select</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>capture/compare event</name>
                                    <description>capture/compare event send dma request</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>update event </name>
                                    <description>update event send dma request</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MMS-->
                        <field>
                            <name>MMS</name>
                            <description>master mode select</description>
                            <bitRange>[6:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UG</name>
                                    <description>UG</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CNT_EN</name>
                                    <description>CNT_EN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UE</name>
                                    <description>UE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPARE PULSE</name>
                                    <description>COMPARE PULSE</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC1REF</name>
                                    <description>OC1REF</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC2REF</name>
                                    <description>OC2REF</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC3REF</name>
                                    <description>OC3REF</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC4REF</name>
                                    <description>OC4REF</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TI1S-->
                        <field>
                            <name>TI1S</name>
                            <description>T1 select</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APTIMx_CH1</name>
                                    <description>APTIMx_CH1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XOR</name>
                                    <description>APTIMx_CH1 XOR CH2 XOR CH3</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS1-->
                        <field>
                            <name>OIS1</name>
                            <description>OC1 IDLE STATUS</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS1N-->
                        <field>
                            <name>OIS1N</name>
                            <description>OC1N IDLE STATUS</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS2-->
                        <field>
                            <name>OIS2</name>
                            <description>OC2 IDLE STATUS</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS2N-->
                        <field>
                            <name>OIS2N</name>
                            <description>OC2N IDLE STATUS</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS3-->
                        <field>
                            <name>OIS3</name>
                            <description>OC3 IDLE STATUS</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS3N-->
                        <field>
                            <name>OIS3N</name>
                            <description>OC3N IDLE STATUS</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OIS4-->
                        <field>
                            <name>OIS4</name>
                            <description>OC4 IDLE STATUS</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_0</name>
                                    <description>MODE_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1</name>
                                    <description>MODE_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
