zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
            </registers>
        </peripheral>
         <!--GPTIM0-->
        <peripheral>
            <name>GPTIM0</name>
            <description>GENERAL TIMER0 Registers</description>
            <groupName>GTIMER</groupName>
            <baseAddress>0x40014400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>GTIMER0</name>
                <value>26</value>
            </interrupt>
            <registers>
                <!--GPTIM0_CR1-->
                <register>
                    <name>GPTIM_CR1</name>
                    <description>GTIMER CONTROL REGISTER1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CEN-->
                        <field>
                            <name>CEN</name>
                            <description>CEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--UDIS-->
                        <field>
                            <name>UDIS</name>
                            <description>UDIS</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--URS-->
                        <field>
                            <name>URS</name>
                            <description>update request</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>update by follows</name>
                                    <description>update by follows</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>update inly by overflow</name>
                                    <description>update inly by overflow</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OPM-->
                        <field>
                            <name>OPM</name>
                            <description>OPM</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>counter not stop</name>
                                    <description>counter not stop</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>counter stop</name>
                                    <description>counter stop</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DIR-->
                        <field>
                            <name>DIR</name>
                            <description>COUNTER DIR</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>up</name>
                                    <description>up</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>down</name>
                                    <description>down</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CMS-->
                        <field>
                            <name>CMS</name>
                            <description>COUNTER ALIGN MODE</description>
                            <bitRange>[6:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>edge align mode</name>
                                    <description>edge align mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>center align mode1</name>
                                    <description>center align mode1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>center align mode2</name>
                                    <description>center align mode2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>center align mode3</name>
                                    <description>center align mode3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ARPE-->
                        <field>
                            <name>ARPE</name>
                            <description>Auto-reload en</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CKD-->
                        <field>
                            <name>CKD</name>
                            <description>CLK_DIV</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>tCK_INT</name>
                                    <description>tCK_INT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2*tCK_INT</name>
                                    <description>2*tCK_INT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4*tCK_INT</name>
                                    <description>4*tCK_INT</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--GPTIM0_CR2-->
                <register>
                    <name>GPTIM_CR2</name>
                    <description>GTIMER CONTROL REGISTER 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCDS-->
                        <field>
                            <name>CCDS</name>
                            <description>capture/compare dma select</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>capture/compare event</name>
                                    <description>capture/compare event send dma request</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>update event </name>
                                    <description>update event send dma request</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MMS-->
                        <field>
                            <name>MMS</name>
                            <description>master mode select</description>
                            <bitRange>[6:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UG</name>
                                    <description>UG</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CNT_EN</name>
                                    <description>CNT_EN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UE</name>
                                    <description>UE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPARE PULSE</name>
                                    <description>COMPARE PULSE</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC1REF</name>
                                    <description>OC1REF</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC2REF</name>
                                    <description>OC2REF</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC3REF</name>
                                    <description>OC3REF</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OC4REF</name>
                                    <description>OC4REF</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TI1S-->
                        <field>
                            <name>TI1S</name>
                            <description>T1 select</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GPTIMx_CH1</name>
                                    <description>GPTIMx_CH1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XOR</name>
                                    <description>GPTIMx_CH1 XOR CH2 XOR CH3</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
