zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--GPTIM0_CCR3-->
                <register>
                    <name>GPTIM_CCR3</name>
                    <description>GPTIM_CCR3</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCR3-->
                        <field>
                            <name>CCR3</name>
                            <description>CCR3</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--GPTIM0_CCR4-->
                <register>
                    <name>GPTIM_CCR4</name>
                    <description>GPTIM_CCR4</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCR4-->
                        <field>
                            <name>CCR4</name>
                            <description>CCR4</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--GPTIM0_DCR-->
                <register>
                    <name>GPTIM_DCR</name>
                    <description>GPTIM_DCR</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DBA-->
                        <field>
                            <name>DBA</name>
                            <description>dma base adress</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DBL-->
                        <field>
                            <name>DBL</name>
                            <description>dma burst length</description>
                            <bitRange>[12:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--GPTIM0_DMAR-->
                <register>
                    <name>GPTIM_DMAR</name>
                    <description>GPTIM_DMAR</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DMAR-->
                        <field>
                            <name>DMAR</name>
                            <description>dma burst register</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--GPTIM0_ITRSEL-->
                <register>
                    <name>GPTIM_ITRSEL</name>
                    <description>GPTIM_ITRSEL</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ITR0SEL-->
                        <field>
                            <name>ITR0SEL</name>
                            <description>ITR0SEL</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ATIM_TRGO</name>
                                    <description>ATIM_TRGO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_RX</name>
                                    <description>UART0_RX</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_RX</name>
                                    <description>UART1_RX</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART4_RX</name>
                                    <description>UART4_RX</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ITR1SEL-->
                        <field>
                            <name>ITR1SEL</name>
                            <description>ITR1SEL</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GPTIM1_TRGO</name>
                                    <description>GPTIM1_TRGO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTHF</name>
                                    <description>XTHF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>RCHF</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPUART0_RX</name>
                                    <description>LPUART0_RX</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ITR2SEL-->
                        <field>
                            <name>ITR2SEL</name>
                            <description>ITR2SEL</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BSTIM_TRGO</name>
                                    <description>BSTIM_TRGO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPUART1_RX</name>
                                    <description>LPUART1_RX</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>RCLP</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>XTLF</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ITR3SEL-->
                        <field>
                            <name>ITR3SEL</name>
                            <description>ITR3SEL</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>COMP1_O</name>
                                    <description>COMP1_O</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RC4M</name>
                                    <description>RC4M</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMP2_O</name>
                                    <description>COMP2_O</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPTOUT1</name>
                                    <description>LPTOUT1</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
