zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33L0XX.SVD
                <!--ADC_CAL-->
                <register>
                    <name>ADC_CAL</name>
                    <description>ADC_CAL</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CAL_EN-->
                        <field>
                            <name>CAL_EN</name>
                            <description>CAL_EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CONV_CAL-->
                        <field>
                            <name>CONV_CAL</name>
                            <description>CONV_CAL</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--ADC_HLTR-->
                <register>
                    <name>ADC_HLTR</name>
                    <description>ADC_HLTR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AWD_LT-->
                        <field>
                            <name>AWD_LT</name>
                            <description>AWD_LT</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--AWD_HT-->
                        <field>
                            <name>AWD_HT</name>
                            <description>AWD_HT</description>
                            <bitRange>[27:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--BEEPER-->
        <peripheral>
            <name>BEEPER</name>
            <description>BEEPER Registers</description>
            <groupName>BEEPER</groupName>
            <baseAddress>0x40015400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--BEEP_CSR-->
                <register>
                    <name>BEEP_CSR</name>
                    <description>BEEPCSR</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BEEPEN-->
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DIV-->
                        <field>
                            <name>DIV</name>
                            <description>BEEPDIV</description>
                            <bitRange>[4:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
